{
  "start_time": "00:27:35",
  "end_time": "01:05:30",
  "theme": "Sanctification",
  "main_verse": "Ephesians 4:1",
  "transcript": [
    {
      "start": "1655",
      "dur": "2.1",
      "text": "So, this isn't just a a future heavenly reality. I mean, it is that, but it's also a present reality of living in relationship with God and living for him."
    },
    {
      "start": "1664",
      "dur": "2.1",
      "text": "You see Christ is our savior and Christ is our sanctifier."
    },
    {
      "start": "1666",
      "dur": "2.1",
      "text": "So he doesn't just cover over our old way of life but he also brings us into something new."
    },
    {
      "start": "1672",
      "dur": "2.1",
      "text": "He provides and makes possible a new kind of life."
    },
    {
      "start": "1679",
      "dur": "3.1",
      "text": "A life that is increasingly purified from sin and consecrated unto God."
    },
    {
      "start": "1685",
      "dur": "3.1",
      "text": "And so, Peter says, you know, stop stop living your old way of life."
    },
    {
      "start": "1692",
      "dur": "1.1",
      "text": "And uh just if any of us at this point are starting to maybe picture a monk in a cloister, kind of dull and stuffy, uh then we have both an impoverished view of the monastic life and an even poorer view of a godly life."
    },
    {
      "start": "1701",
      "dur": "2.1",
      "text": "Because when you think about a a holy or a godly life, I want us to try thinking first about Jesus."
    },
    {
      "start": "1715",
      "dur": "2.1",
      "text": "He he's he's our example, right? is literally God in the flesh."
    },
    {
      "start": "1737",
      "dur": "2.1",
      "text": "And so Jesus is the preeminent example for us of what holiness looks like in a human being."
    },
    {
      "start": "1744",
      "dur": "3.1",
      "text": "So what kind of things can we observe as we look at Jesus?"
    },
    {
      "start": "1751",
      "dur": "3.1",
      "text": "Certainly we see a morally pure life, right? He is without sin."
    },
    {
      "start": "1759",
      "dur": "2.1",
      "text": "Jesus isn't living for himself. He's living for the Father."
    },
    {
      "start": "1771",
      "dur": "2.1",
      "text": "And that's not a one-off moment, but that's just the the consistent and constant orientation of his life."
    },
    {
      "start": "1781",
      "dur": "2.1",
      "text": "He's consecrated himself to God. He set apart his life to do his father's will."
    },
    {
      "start": "1799",
      "dur": "1.1",
      "text": "Indeed, his acts of compassion, of love and mercy, those are part and parcel of what what a holy life is."
    },
    {
      "start": "1807",
      "dur": "2.1",
      "text": "A sanctified life is a life separated from sin so that it can be set apart unto God."
    },
    {
      "start": "1826",
      "dur": "3.2",
      "text": "A holy life is an is an impactful life and a differencemaking life."
    },
    {
      "start": "1847",
      "dur": "3.2",
      "text": "And the key is Christ our sanctifier."
    },
    {
      "start": "1865",
      "dur": "2.1",
      "text": "So through being connected to him in faith, in prayer, in Bible study and worship that his divine power comes into us and transforms and sanctifies our hearts, our minds, and ultimately our character and our behavior."
    },
    {
      "start": "1881",
      "dur": "3.1",
      "text": "Through the Holy Spirit, God takes up residence in us."
    },
    {
      "start": "1900",
      "dur": "3.1",
      "text": "Christ gives us his spirit, he gives us his body, right? That the church and Christ our sanctifier also continues to meet us with forgiveness and grace."
    },
    {
      "start": "1931",
      "dur": "2.1",
      "text": "Though we're called to be holy and given everything we need to live a godly life, uh Jesus knows that we won't always achieve it."
    },
    {
      "start": "1952",
      "dur": "2.1",
      "text": "He is faithful and just and will forgive us our sins and purify almost sanctify us from all unrighteousness."
    },
    {
      "start": "1985",
      "dur": "2.1",
      "text": "So I just want to pray the words uh again of Paul from 1 Thessalonians 5 over you as a word of blessing."
    },
    {
      "start": "2017",
      "dur": "2.1",
      "text": "So may God himself, the God of peace, sanctify you through and through."
    }
  ]
}
