{
  "start_time": "00:34:13",
  "end_time": null,
  "theme": "Resurrection",
  "main_verse": "John 11:25-26",
  "transcript": [
    {
      "start": "2049.52",
      "dur": "7.04",
      "text": "Good morning, pastor. Good morning. And it is a good morning."
    },
    {
      "start": "2056.56",
      "dur": "7.119",
      "text": "Bright sunshine, the temperatures uh well, not as good as in Phoenix, but uh"
    },
    {
      "start": "2063.679",
      "dur": "5.679",
      "text": "you know, one thing I've noticed some I check the actuarial tables and and as I"
    },
    {
      "start": "2069.359",
      "dur": "8.961",
      "text": "look at it, I see that uh that uh it the fatality rate for humanity is 100%."
    },
    {
      "start": "2078.32",
      "dur": "6.838",
      "text": "So, think about it. None of you are getting out of here alive."
    },
    {
      "start": "2086.079",
      "dur": "6.721",
      "text": "Although it may not be. It'll be sooner or later. Hopefully later. All right. But anyway, uh you know, don't be shy to"
    },
    {
      "start": "2092.8",
      "dur": "6.319",
      "text": "come up to me and ask me about all this. That's all right. I'm a big boy. I can handle it. You want to come up and ask,"
    },
    {
      "start": "2099.119",
      "dur": "5.441",
      "text": "\"Are you going to die?\" You know, and I'll say, \"Well, someday.\" Yeah. I I'm"
    },
    {
      "start": "2104.56",
      "dur": "7.16",
      "text": "You know, well, one thing you can say about cancer, it grows on you, you know. So anyway,"
    },
    {
      "start": "2112.079",
      "dur": "6.241",
      "text": "you don't know how long I've been waiting to tell that joke. All righty."
    },
    {
      "start": "2118.32",
      "dur": "6",
      "text": "Well, so here uh we have survived another Halloween holiday. Now, I know"
    },
    {
      "start": "2124.32",
      "dur": "8.48",
      "text": "we don't acknowledge such a time, but you have to admit that almost all of our society wallows in this bunch of hoie."
    },
    {
      "start": "2132.8",
      "dur": "7.92",
      "text": "You know, the dark side uh loves its one day of the year, I guess. And and and that's okay. After all, don't we have a"
    },
    {
      "start": "2140.72",
      "dur": "5.6",
      "text": "holiday for atheists uh on April 1st?"
    },
    {
      "start": "2146.32",
      "dur": "6.32",
      "text": "That's a growner. You You got to think about that one. Okay, let's turn our let's turn"
    },
    {
      "start": "2152.64",
      "dur": "7.84",
      "text": "Halloween on his pointy little head and actually learn some lessons to help us in our Christian walk. Let's discuss"
    },
    {
      "start": "2160.48",
      "dur": "5.599",
      "text": "the Walking Dead. Stories about zombies, it is said, fill"
    },
    {
      "start": "2166.079",
      "dur": "6.161",
      "text": "us all with terrible dread. Lazarus kicked off. And don't you dare"
    },
    {
      "start": "2172.24",
      "dur": "5.52",
      "text": "scoff as I tell you about the real Walking Dead."
    },
    {
      "start": "2177.76",
      "dur": "6.48",
      "text": "All right, we all remember the Walking Dead TV franchise. Uh, it's all pretty silly. Really, I did kind of enjoy it."
    },
    {
      "start": "2184.24",
      "dur": "5.2",
      "text": "All right, I enjoy silliness. Okay. But you know, much literature when you get"
    },
    {
      "start": "2189.44",
      "dur": "5.84",
      "text": "down to it, even horror literature, uh, books, movies, TVs, uh, TV shows, that"
    },
    {
      "start": "2195.28",
      "dur": "8.319",
      "text": "kind of thing are really what they're doing is they are exploring the innermost fears and hang-ups that we"
    },
    {
      "start": "2203.599",
      "dur": "7.361",
      "text": "people have. For instance, Frankenstein uh or Frankenstein,"
    },
    {
      "start": "2210.96",
      "dur": "6.08",
      "text": "if you all know that movie, uh is really an explanation of man's desire to be"
    },
    {
      "start": "2217.04",
      "dur": "6.48",
      "text": "God, to finally take control of life and death."
    },
    {
      "start": "2223.52",
      "dur": "5.52",
      "text": "Remember, that's what got Adam and Eve a lot of trouble when when Satan tempted"
    },
    {
      "start": "2229.04",
      "dur": "5.92",
      "text": "Eve by saying, among other things, you can be like God."
    },
    {
      "start": "2234.96",
      "dur": "8.399",
      "text": "Hm. Didn't work out so well, did it? Dracula, I think, is a metaphor for"
    },
    {
      "start": "2243.359",
      "dur": "5.841",
      "text": "letting evil into your life. Remember, Dracula can't come into your"
    },
    {
      "start": "2249.2",
      "dur": "6.879",
      "text": "room unless you invite him. So, a lot of his effort is convincing you uh to let"
    },
    {
      "start": "2256.079",
      "dur": "6.401",
      "text": "him in. Kind of like the devil does. The devil throws his temptations in our"
    },
    {
      "start": "2262.48",
      "dur": "5.599",
      "text": "face and finally we break down and invite the devil into our lives like"
    },
    {
      "start": "2268.079",
      "dur": "7.04",
      "text": "Dracula coming through the door or the window and the result is deadly."
    },
    {
      "start": "2275.119",
      "dur": "6.72",
      "text": "And of course there's the aforementioned Walking Dead. It it's all about the very popular theme of what to do in the"
    },
    {
      "start": "2281.839",
      "dur": "6.321",
      "text": "zombie apocalypse. Most people succumb to the zombie virus, but a small band of"
    },
    {
      "start": "2288.16",
      "dur": "6.4",
      "text": "still normal people fight for survival. Kind of reminds us reminds us of us,"
    },
    {
      "start": "2294.56",
      "dur": "6.72",
      "text": "aren't we? Kind of a small band of people making our way through the apocalypse of mostly lost people in this"
    },
    {
      "start": "2301.28",
      "dur": "7.6",
      "text": "world. And you know, there are forces out there in society that would try their best to turn us into one of them,"
    },
    {
      "start": "2308.88",
      "dur": "8.959",
      "text": "non-believers. And while nobody wants to descend upon us and eat us yet, still is the effect"
    },
    {
      "start": "2317.839",
      "dur": "6.081",
      "text": "that the effect is the same which is death and death eternal."
    },
    {
      "start": "2323.92",
      "dur": "6.24",
      "text": "They would try to rob us of our salvation uh if if they could."
    },
    {
      "start": "2330.16",
      "dur": "5.76",
      "text": "And when you really get down to it, at the end of the day, persecution is persecution."
    },
    {
      "start": "2335.92",
      "dur": "6.159",
      "text": "uh whether it's like violence like they have overseas. We see all the people"
    },
    {
      "start": "2342.079",
      "dur": "6.881",
      "text": "over in Africa being slaughtered just because they're Christians. In fact, it's so bad that the State Department's"
    },
    {
      "start": "2348.96",
      "dur": "6.24",
      "text": "kind of getting involved, telling them, \"You better do something about this or we'll do it for you.\" You know, wow,"
    },
    {
      "start": "2355.2",
      "dur": "6",
      "text": "that's a breath of fresh air. It's still whether it's that or just"
    },
    {
      "start": "2361.2",
      "dur": "5.68",
      "text": "persecution like we have here at home which is more cerebral uh it's all aimed"
    },
    {
      "start": "2366.88",
      "dur": "5.92",
      "text": "at destroying our faith and our eternal destiny."
    },
    {
      "start": "2372.8",
      "dur": "6.319",
      "text": "Every zombie show has its own rules about how zombies act and stuff, but you"
    }
  ]
}
