[
  {
    "text": "[Music] Congratulations. [Music] Good morning everyone. Welcome to morning worship. First Sunday of the month, communion uh Sunday this morning and brunch fellowship afterwards. So we're glad you're here. We're celebrating our opening song. We're celebrating our good good father who loves us beyond measure. Matter of fact, I'm the greeting elder today. So, I'll be in the pastor's office uh briefly afterwards if uh anyone would like some one-on-one prayer. Our opening scripture this morning, I'm going to do this u we normally do it after the opening song, but this is from First John chapter 3. It's on page about 12 29 in your Bibles. John says this, \"See what great love the father has lavished on us that we should be called children of God.\" And that is what we are. The reason the world does not know us is that it did not know him. Dear friends, now we are children of God, and what we will be has not yet been made known. But we know that when Christ appears, we shall be like him, for we shall see him as he is. Amen. All who have this hope in him purify themselves just as he is pure. So, amen to that. We are children of God. I'm going to heaven. How about you? Amen. Amen. Let's uh worship the father together this morning. [Music] Oh, I've heard thousand stories of what they think you're like, but I've heard the tender whisper of love. the dead of night. And you tell me that you're pleased and head out. Never alone. You're a good father. It's who you are. It's who you are. It's who you are. And I'm loved by you. It's who I am. It's who I am. It's who I am. Oh, I've seen many searching for answers far and wide. But I know we're all searching for answers. Only you provide. Cuz you know just what we need. Before we say a word, you're a good, good, Father. It's who you are. It's who you are. It's who you are. And I'm loved by you. It's who I am. It's who I am. It's who I am. You are perfect in all of your ways. You are perfect in all of your ways. You are perfect in all of your ways to us. You are perfect in all of your ways. You are perfect in all of your ways. You are perfect in all of your ways. to us. Oh, it's love so undeniable. I can hardly speak, be so unexplainable. I can hardly think as you call me. Deeper still as you call. Deeper still as you call. Deeper still into love. Love. Love. You're a good good father. It's who you are. It's who you are. It's who you are. And I'm loved by you. It's who I am. It's who I am. It's who I am. Your good, good father. It's who you are. It's who you are. It's who you are. And I'm loved by you. It's who I am. It's who I am. It's who I am. Father God, we just thank you for this morning. Thank you for this morning of life, for the air we have in our lungs and for uh the beautiful day that we enjoy. Thank you for your marvelous creation and for this family of Christ that meets in this place. Lord, be with us today. Inhabit our praises with your Holy Spirit as we lift the name of Jesus. And everyone said, \"Amen.\" Amen. Let's stand and celebrate how the Lord keeps us going day by day. [Music] Jesus, Jesus, Jesus, sweetest name I know fills my every longing. Teach me sing as I go. There's within my heart a meloy. Jesus whispers sweet and low. Fear not. I am with thee. Peace be still. In all of life and flow. All my life was wrecked by sin and strife. Breath fulfilled my life with pain. Jesus wept across the broken stream. Stir the stumbling cords again. Jesus. Jesus. Jesus. Sweetest name I know. Fill my every longing. He keeps me singing as I go. Feasting on the riches of his grace, resting his sheltering wings. [Music] Always looking on his smile and faith. That is why I shout and sing. Though sometimes he leads through the waters deep, trials fall across my way. Though sometimes the past seems rough and steep, see his footprints all the way. Jesus, Jesus, Jesus, sweetest name I know. Fills my every longing. He keeps me singing as I go. Soon he's coming back to welcome me far beyond the starry sky. I shall wing my flight to world unknown. I shall ring with him on high. Sing it. Jesus Jesus Jesus name I know. fulfills my every longing and keeps me singing as I go. Jesus, Jesus, Jesus, sweetest name I know. Fills my every longing. Keep me singing as I go. Say good morning to somebody next to you this morning. Jesus, Jesus, Jesus, sweetest name I know. Build my every me singing as I go. [Music] [Music] [Applause] [Music] Holy, holy, holy. Holy, holy, holy, holy is the Lord God Almighty. [Music] Worthy to receive glory. Worthy to receive honor. worthy to receive all our praise today. [Music] Holy, holy, holy, holy, holy, holy, holy is the Lord God Almighty. Worthy to receive gloryy. Worthy to receive honor. Worthy to receive all our praise today. Praise him. Praise him and lift him up. Praise him. Exalt his name forever. Oh, praise him. Praise him and lift him up. Praise him. Exalt his name forever. [Music] Holy, holy, holy, holy, holy, holy, holy is the Lord God Almighty. Worthy to receive glory. Worthy to receive honor. Oh, he's worthy to receive all our praise today. [Music] Praise [Music] him. [Music] Praise him and lift him up. Praise him. Exalt his name forever. Oh, praise him. [Applause] Praise him and lift him up. Praise him. Exalt his name forever. [Music] Holy, holy, holy, holy, holy, holy, holy is the Lord God Almighty. worthy to receive glory. He's worthy to receive honor. [Music] Worthy to receive all our praise today. Praise him. [Music] Praise him and lift him up. Praise him. Exalt his name forever. Oh, praise him. Praise him and lift him up. Praise him. Exalt his name forever. [Music] Oh, praise him. Praise him and lift him up. Praise him. Exalt his name forever. [Music] Good morning. You can be seated. Thank you, Lord. Couple of announcements this morning. If you're visiting with us for the first time, man, you hit into it today. Brunch fellowship going across the street today in the youth center. So, join us before you go home. I'll be in the pastor's office for the first little while. Operation Christmas Child. I know the boxes are out. I think they're in the foyer and I think they're across the street. So, we'll be gathering those boxes and there's uh explanations there if you haven't done it before. And uh that'll be due on the 16th, which is just what a couple weeks away. Pie and praise, one of my favorite gatherings by the way, will be on the 23rd. Stippers will be hosting that. That'll be at 6:30 right here in this space. Amen. is going to BA Baptist uh the end of the month. Rich Bead is the person to talk to about that. Did somebody had something they wanted to mention this morning that I have forgotten? Go ahead, Rich. Okay. All right. So, boxes for socks are here and down below. They bring those to Bula and along with helping to serve the food. So, there we go. Uh right now we're going to release the kids for junior church. They can go ahead as we get ready for communion. Pastor will come. Good morning, Pastor Keith. All right. Oh, there we go. As the thundering herd makes its way out the out the door and we prepare our hearts for communion. So, I need a couple of elders front and center. Whoever did we think about who was doing that today? We didn't. We did not. Did we? All right. Here comes Allan. Uh Allan, come forth. And And here's here comes uh Lenny. Well, we got one side covered. Now, we need to get the other side covered. So, uh somebody come forth. You know, there's a there is a big threat I could give here. There are churches who have uh women serve communion. We could threaten them with that, couldn't we? Which I don't really think is a threat. But anyway, neither here nor there. Want to talk a talk a minute here, of course, to 1 Corinthians 11. The Lord Jesus on the night he was betrayed took bread and when he had given thanks, he broke it and said, \"This is my body which is for you. Do this in remembrance of me.\" In the same way, after supper, he took the cup, saying, \"This cup is the new covenant in my blood. Do this whenever you drink of it in remembrance of me.\" You know, this is the most holy and sacred part of our time together today. and and this time we come together around uh the Lord's table and partake of the Lord's supper. And there is some heavy symbolism here. Uh our table in most Protestant churches uh resembles not the actual table that the Lord and his disciples gathered around, but rather something out of a Michelangelo painting. Uh in fact, that very very famous painting uh of the Lord's supper is horribly incorrect. But you know what? That's not important. Our our bread and this little cup has little if any physical resemblance to that which Jesus and his disciples parttook of uh during that Passover feast. But you know what? That's not important. What is important is that we the followers of Christ gather here at this place and we partake of this unleavened bread which is called and that which is called the fruit of the vine. And we do so in the memory of Jesus, remembering him and all that he has done for us. And that's what's important. Where are our minds this morning? I pray that it's on Jesus. And if Jesus is your savior, please partake with us. Uh, one of the guys will come and pray and then we will pass the bread out and hold on to it. We will partake of it together. And the same with the cup. Uh, one of the guys will pray for the cup, then we will pass it out, and then we will partake of it together, all the while remembering our awesome Lord Jesus. Gentlemen, let's give thanks for the bread. Dear Father, we thank you for today, this particular time that we think of what you did for us. And we pray that that would have an impact on us every day. And if um there's somebody here who hasn't made that decision yet, we pray that they'd be nudged closer to considering it because it's uh affects one's life for now and for eternity. Thank you again for giving your body up for us. Jesus name. Amen. Let us partake together of the body of Christ. Let us pray. Dear Lord, it says there is no remission of sin without the shedding of blood. We thank you for giving us your son and shedding his blood to pay for our sins so that we may have life beyond this world. Help us to examine ourselves, see how we can do better to serve him and serve others, Lord, as he did while he was here. His name we pray. Amen. Amen. And in the name of Jesus, we participate in the cup represents the blood of our Jesus which seals the covenant that ensures our salvation. Let us partake. Thank you, brothers. [Music] Our last song of worship before we go to uh congregational prayer and pastor comes. One from uh 1933. kind of a monastic kind of a chant. Oh spirit of the living God. [Music] Oh spirit of the livinging God, thou light and fire divine. Descend upon thy church once more and make it truly thine. Fill it with love and joy and power, with rightuousness [Music] and peace, till Christ shall dwell in human hearts and sin and sorrow cease. Oh, oh, oh. [Music] Blow wind of God with wisdom blow until our minds are free [Music] from midst of their clouds of hell which blind our eyes to thee. Burn wing it fire. Inspire our lips with flameing love and z to preach to all the bravehood God's glorious common will. Oh wo. [Music] Oh woah. Oh woah. [Music] Teach us to other livinging words with truth which all may hear. The language all may understand. When love speaks loud and clear [Music] till every age and race and climb shall blend their cre as one. And earth shall form one family by whom thy will is done. Oh, [Music] so shall we know the power of Christ who came this world to save. [Music] So shall we rise with him to light with so beyond the grave. And I shall with true holyness and faith thy children. Till perfected by thee we reach creation's glorious go. Oh. Oh. [Music] Oh. [Music] Oh. Oh. Oh. [Music] Thank you, Lord. When the perfect shall come, the temporary will pass away. We will see you face to face, no longer in a mirror, dimly, but in your presence. What a joy it will be to stand before Christ in that day. Some of us have already passed. The saints who have gone before. Those of us who remain, we carry the name of Christ until the day we die. We proclaim him and him alone who brings glory and honor and praise to you God the Father in Jesus name. We do have some prayer requests we need to uh go over this morning and pastor uh going to just speak speak a word here before we go to that. All righty. Well, yes, something I wanted to to say as we get into uh prayer time and I wanted me to be the one uh announcing it. And finally, at long last, we have answers to the uh all the biopsies and tests and all that good stuff. And and and I have uh as I've said several times, I have good news and bad news. The good news is it's treatable with chemo. The bad news is I seem to have inherited B cell lymphoma. So yeah, that's called cancer. So, yes, I have cancer. And so, now my next little bit will be treating that. And and and I'm still don't really know what all that's going to entail because I haven't met with the uh with the uh the proper doctors yet, the oncologist, and that'll be week after next, and then we'll kind of be able to map things out. So anyway, yes, your pastor has cancer and and but no, I tell you what. So now my goal is to join the legion of people who are cancer survivors and I'm going to do that if the Lord lets me. Otherwise, the Lord may have accepted my application to go to the home office. And and when you really think about that, is that so bad? You know, is that really so bad? It's not. It's it's just fine. So anyway, I do covet your prayers. There have been many prayers lifted up. Uh but I covet many more prayers and we will see what the future will hold. Amen. Thank you, Paul. Amen. And you're not leaving here one day sooner than he ordains. That's that's true. That's true. All of us uh can take comfort in that. We'll be we'll be laying hands on pastor down below uh today during fellowship time. going to read uh to go along with our uh praise to God the Father today, the end of the the passage of uh the prodigal son. And uh this is in Luke 15 uh starting in verse 18. The boy when he finally comes to himself, he says, \"I will set out and go back to my father and say to him, Father, I have sinned against heaven and against you. I am no longer worthy to be called your son. Make me like one of your hired servants. And so he got up and went to his father. But while he was still a long way off, his father saw him and was filled with compassion for him and he ran to his son, threw his arms around him and kissed him. You know the the culture of the day, the father would never run. number one and he would especially never run to a son who had been um who who had been separated from him and in a life of sin. But here we see a picture of God the Father u running to us, throwing his arms around us and kissing us. Amen. What a what a good uh what a good passage. Thank you, Lord. We do want to uh we're we're going to add Pastor Keith to our list of people that were praying uh for cancer which include uh Jim, Jim Jr. Stuart, Kristen, Debbie, uh Teresa, and Denise. Father, we do lift all these before you as well as our pastor this morning. What a dreaded disease that uh humanity has upon it. But um Lord, the the disease of sin is much worse and much and uh totally fatal. Not only separating us from this physical life, but separating from you and all that is good. Thank you, Jesus, for dying in our place that we might have life and have it eternal. We do pray for our church, for leaders, for the uh the various teams that are in place right now uh getting ready for pastor next. And we just pray that uh you have gone before us and prepared that person and prepare those who will be calling him uh to have discernment and wisdom and the guidance of your spirit. And do Lord, we also pray for our country, for our leaders, everyone from local up to federal uh guide and protect them uh and work your will uh in this mess that we are in. Uh we need your help, Lord, in in a big way. uh not that you are unaware of it, but uh we would pray that as a country that we would repent and uh and turn our hearts toward uh the God of our making and um and and serve you with our hearts. Protect our leaders, Lord. We also pray for uh all those in harm's way. Uh the people who are in uh the military, people who are first responders, our police, uh all those uh valuable lives that uh seek to help those who are in need. God bless them, protect them, and uh help them in their mission. Lord, we we give this day to you. This is the the Lord's day, the first day of the week. Early on the first day of the week, they came to the tomb and the tomb was empty. Thank you, Jesus, that you are a living savior seated at the right hand of the father, interceding for us as we speak this morning. We just ask you now that you would uh give pastor the words this morning to uh preach from your word and deliver it with uh conviction and love in Jesus precious name. Amen. Amen. All right. Thank you. Good morning, pastor. Good morning. And it is a good morning. Bright sunshine, the temperatures uh well, not as good as in Phoenix, but uh you know, one thing I've noticed some I check the actuarial tables and and as I look at it, I see that uh that uh it the fatality rate for humanity is 100%. So, think about it. None of you are getting out of here alive. Although it may not be. It'll be sooner or later. Hopefully later. All right. But anyway, uh you know, don't be shy to come up to me and ask me about all this. That's all right. I'm a big boy. I can handle it. You want to come up and ask, \"Are you going to die?\" You know, and I'll say, \"Well, someday.\" Yeah. I I'm You know, well, one thing you can say about cancer, it grows on you, you know. So anyway, you don't know how long I've been waiting to tell that joke. All righty. Well, so here uh we have survived another Halloween holiday. Now, I know we don't acknowledge such a time, but you have to admit that almost all of our society wallows in this bunch of hoie. You know, the dark side uh loves its one day of the year, I guess. And and and that's okay. After all, don't we have a holiday for atheists uh on April 1st? That's a growner. You You got to think about that one. Okay, let's turn our let's turn Halloween on his pointy little head and actually learn some lessons to help us in our Christian walk. Let's discuss the Walking Dead. Stories about zombies, it is said, fill us all with terrible dread. Lazarus kicked off. And don't you dare scoff as I tell you about the real Walking Dead. All right, we all remember the Walking Dead TV franchise. Uh, it's all pretty silly. Really, I did kind of enjoy it. All right, I enjoy silliness. Okay. But you know, much literature when you get down to it, even horror literature, uh, books, movies, TVs, uh, TV shows, that kind of thing are really what they're doing is they are exploring the innermost fears and hang-ups that we people have. For instance, Frankenstein uh or Frankenstein, if you all know that movie, uh is really an explanation of man's desire to be God, to finally take control of life and death. Remember, that's what got Adam and Eve a lot of trouble when when Satan tempted Eve by saying, among other things, you can be like God. Hm. Didn't work out so well, did it? Dracula, I think, is a metaphor for letting evil into your life. Remember, Dracula can't come into your room unless you invite him. So, a lot of his effort is convincing you uh to let him in. Kind of like the devil does. The devil throws his temptations in our face and finally we break down and invite the devil into our lives like Dracula coming through the door or the window and the result is deadly. And of course there's the aforementioned Walking Dead. It it's all about the very popular theme of what to do in the zombie apocalypse. Most people succumb to the zombie virus, but a small band of still normal people fight for survival. Kind of reminds us reminds us of us, aren't we? Kind of a small band of people making our way through the apocalypse of mostly lost people in this world. And you know, there are forces out there in society that would try their best to turn us into one of them, non-believers. And while nobody wants to descend upon us and eat us yet, still is the effect that the effect is the same which is death and death eternal. They would try to rob us of our salvation uh if if they could. And when you really get down to it, at the end of the day, persecution is persecution. uh whether it's like violence like they have overseas. We see all the people over in Africa being slaughtered just because they're Christians. In fact, it's so bad that the State Department's kind of getting involved, telling them, \"You better do something about this or we'll do it for you.\" You know, wow, that's a breath of fresh air. It's still whether it's that or just persecution like we have here at home which is more cerebral uh it's all aimed at destroying our faith and our eternal destiny. Every zombie show has its own rules about how zombies act and stuff, but you know, as much as I love a good zombie movie, uh you'll be surprised to learn I'm not here to talk about zombies. No, we're here to teach about life and life eternal. So, I propose we do that by looking at life from the vantage point of a dude who found himself in the fantastic position of having died, but he was raised by our Lord to walk again to fulfill his divine purpose. And of course, uh, as as we can tell, I want to talk about Lazarus. Now, we find this in the 11th chapter of John. Got a bit of scripture to read, so we better get to it. Starting in verse one. Now, a man named Lazarus wasn't sick. He was from Bethany, the village of Mary and her sister Martha. This Mary, whose brother Lazarus now lay sick, was the same one who poured perfume on the Lord and wiped his feet with her hair. So the sisters sent word to Jesus, \"Lord, the one you love is sick.\" When he heard this, Jesus said, \"This sickness will not end in death. No, it is for God's glory so that God's son may be glorified through it.\" Now Jesus loved Martha and her sister and Lazarus. So when he heard that Lazarus was sick, he stayed where he was two more days. Then he said to his disciples, \"Let us go back to Judea.\" But rabbi, they said, \"A short while ago, the Jews there tried to stone you, and yet you want to go back.\" Jesus answered, \"Are there not 12 hours of daylight? Anyone who walks in the daytime will not stumble, for they see uh by this world's light.\" It is when a person walks at night that they stumble, for they have no light.\" After he had said this, he went on to tell them, \"Our friend Lazarus has fallen asleep, but I'm going there to wake him up.\" His disciples reply replied, \"Lord, if he sleeps, he'll get better.\" Jesus had been speaking of his death, but his disciples thought he meant natural sleep. So then he told them plainly, \"Lazarus is dead, and for your sake I I'm glad I was not there so that you may believe, but let us go to him.\" Then Thomas, also known as Ditimus. Have we preached about him lately? I think we have. Yeah. Uh said to the rest of the disciples, \"Let us also go that we may die with him.\" All right, let's set up the scene. Jesus and his disciples escaped the Jewish leaders who were trying to kill him. And they went up and crossed the Jordan back to the place where John the Baptizer had been immersing folks back in the day. So, they're hanging out there and and and here comes the message. Lazarus, who you love is sick. Real sick. Jesus response is, \"Don't worry about it. This isn't going to end up uh in death.\" So, they so they hang there for two more days. Then Jesus gets up and says, \"We have to go to Bethany.\" Whoa. The disciples said, \"There are a lot of powerful people trying to do you in.\" to which Jesus says, \"I got this. Walk in the light. You see what's around you. Those in the darkness stumble.\" So now comes the announcement that Lazarus has died. The disciples don't get it since Jesus used the metaphor of sleep. They say logically, \"So, hey, sleep's good for you if you're sick.\" So Jesus has to just come out and say, \"Lazarus is dead.\" And it's a good thing I wasn't there. which when you get down to it means Jesus, if Jesus had been there, he would not have let Lazarus die. But the truth of the matter is Lazarus had to die so that this example of God's awesome power and the power manifested in his son Jesus. Uh the Jesus, you know, we're talking about it 2,000 years later and we will until the end of days. to which Thomas the twin plays Debbie Downer and says, \"Ah, let's all go and die with him.\" Well, that's a drag. Okay. Jesus and his entourage arrive. Verse 17. On his arrival, Jesus found Lazarus had already been in the tomb for 4 days. Now, Bethany was less than two miles from Jerusalem, and many Jews had come to Martha and Mary to comfort them at the loss of their brother. When Martha heard that Jesus was coming, she went out to meet him. But Mary stayed at home. Lord, Martha said to Jesus, \"If you had been here, my brother would not have died.\" But I know that even now God will give you whatever you ask. Jesus said to her, \"Your brother will rise again.\" Martha answered, \"I know that he will rise again in the resurrection at the last day.\" Jesus said to her, \"I am the resurrection and the life. The one who believes in me will live even though they die. And whoever lives by believing in me will never die. Do you believe this? Yes, Lord, she replied. I believe that you are the Messiah, the son of God who is to come into the world. Now, this is one of those great I am statements. A couple of thoughts here. I'm wondering about Martha's countenance to Jesus. Was she angry, accusing, shouting even? or was she sad and forlorn seeking comfort? Also, it would appear that Martha did have some understanding where life was going in all this. She knew of the resurrection of the last day. Martha goes to Mary who comes out of the house and to where Jesus was with all the mourers trailing behind her and she falls at Jesus' feet again wondering where in in the heaven was he had he just been here. It's such a powerful moment. Mary face down bow bowing out before him pours out her grief and and it's so powerful that Jesus joins her in this outpouring. Now remember these are close friends of Jesus. They're not business associates. They're not acquaintances. They have spent significant time together and they've made a bond of friendship and love that is deep. So he asked, \"Where's the tomb?\" And the entire entourage goes there. Of course, there were gripers and grumblers grumbling around about Jesus not being there to save Lazarus. After all, he cured a blind man, didn't he? Surely, he could have healed his friend. Did you know that there is a traditional place that has been identified since the 4th century as Lazarus's tomb? Is it the real McCoy? Well, you can make a case either way. We do know that's in the it's in the vicinity if nothing else. Looks like some American tourists there having a good time. Also looks like they really could spend some money on some new signs and landscaping. Yeah. All right, let's go back to the text. Verse 38. Jesus, once more deeply moved, came to the tomb. It was a cave with a stone laid across the entrance. Take away the stone, he said. But Lord, said Martha, the sister of the dead man. By this time there is a bad odor, for he's been there four days. Then Jesus said, did I not tell you if you believe you will see the glory of God? So they took away the stone. Then Jesus looked up and said, \"Father, I thank you that you've heard me. I knew that you always hear me, but I said this for the benefit of the people standing here that they may believe that you sent me.\" When he had said this, Jesus called out in a loud voice, \"Lazarus, come out.\" The dead man came out, his hands and feet wrapped with strips of linen and a cloth around his face. He said to them, \"Take off the grave clothes and let him go.\" All right. Sometimes, you know, while I like to preach and study NIV, I I still appreciate the language of the bard of Shakespeare of King James and and when Marth when she said, \"Uh, he surely stinkketh.\" That's a lot more graphic. There's a bad odor. You know, NIV is way too sterile for my Anyway, uh anyway, okay, here we go. All righty. When you get down to it, the account of the miracle itself is short, sweet, and to the point. You have the telling of Jesus's distress. What was he so upset about? Wording would indicate not just grief, but significant anger. Now, theologians have put up several ideas, including maybe he was just upset that all those mourers were just fake. You know, they that's just what they do. They travel around and and uh whail and moan and and uh Jesus hates falseeness. And uh you know, uh maybe maybe he was steamed that some people are going to see a tremendous miracle and yet write him out to the authorities anyway. Yeah, who knows? Maybe there were forces at work in the spiritual realm that we would know nothing about, but that Jesus would be aware of. Maybe Satan thought he had just pulled one over on Jesus. Now, we won't know the answer to any of these questions until we're there with Jesus in glory. But the simplicity of the narrative has the ring of truth in it. This is an eyewitness account of an extraordinary event in the ministry of Jesus. No fancy exclamations or explanations or explanations, no outbursts of extraneous detail, just a report of the facts as they happened. Lazarus was dead. Yet he walked the walking dead, so to speak. Which brings us to our sermon in a sentence, which is we are the walking dead, but we have life in Jesus the Messiah. So tell me, how many times have you died? I mean, I I don't mean how how many times you coded in the hospital and they brought you back. I mean, how many times have we died spiritually? When we ponder this question, we realize that we really are the walking dead. And thanks be to God, we have life in Jesus. So, let's flesh this out. Number one, walking dead in sins. Paul said in Ephesians 2:1, \"As for you, you were dead in your transgressions transgressions and sin.\" You know, Paul here admits that we all lived among them at one time. lived among the walking dead, steeped in our disobedience, following the kingdom of the air, gratifying the cravings of the flesh, following the desires and thoughts of that. Because of all that, we were walking around spiritually dead, destined for death and damnation. It's a terrible place to be living among them, as Paul says. So, so, huh, that's a bummer. The next death is good. walking dead to sin. We see the difference. We the walking dead go from walking uh dead in sin to being the walking dead to sin. Death is separation. When when we're dead in sin, we're separated from God. When we're dead to sin, we're separated from evil. Romans 6:11. In the same way, count yourselves dead to sin, but alive to God in Christ Jesus. The most horrifying effect of sin is that it separates us from God. Think about it. When when the dead in sin die a physical death, the result is separation from God and eternity in hell. We don't preach much about hell, do we? We're not supposed to tell people that sinners go to hell. It's not at all loving to talk about hell. In fact, it's frightening and some people find it offensive. But uh who are we to not warn people about this? Jesus described it as a place of wailing and nashing of teeth. Sometimes it's given the name of of the Jerusalem city trash. Did you know that? Gehenna. which means uh if you're in hell, you're not uh in the you're in the not so sanitary landfill of the cosmos. There you are. No hope, no comfort, no torment and regret, and it never ends. We're going to talk a lot more about this. I think that'll be next week. This is it's what we call a tease. You know, Revelation 14:11. And the smoke of their torment will rise forever and ever. There will be no rest. day or night for those who worship the beast and its image or for anyone who receives the mark of its name. All right. Number three, walking dead in Jesus. And this is what it's all about. I know that present day society just wants to hear about rainbows and unicorns. Nobody wants to be told they're not perfect. They're not just fine. They're not cool and groovy. Sorry for the anacronism there. Uh, nobody wants to hear anything except heaven waiting and what they call the afterlife. The walking dead in their sins threw up a huge smoke screen that dictates what God can and cannot say to them. But we who are of the household of faith know in whom we have uh we we have in whom we have hope in whom we have faith in whom we are immersed in love. We are cleansed by his blood raised up in newness of life. And we shall overcome not by anything we've done but by the grace of the Lord most high. Romans 6 3 and 4. Don't you know that all of us who were baptized, immersed into Christ Jesus were baptized into his death? We were therefore buried with him through baptism into death in order that just as Christ was raised from the dead through the glory of the father, we too may live a new life. And that's the whole kitten kaboodleoodle right there. So when we talk about the walking dead, we're not talking about death as the world knows it. We're talking about life, life, living it to the full. But a great and terrible day of the Lord is coming. First Thessalonians 4:16, for the Lord himself will come down from heaven with a loud command, with the voice of the archangel, with the trumpet call of God, and the dead in Christ will rise first. So for now, we're here. And here's what I want us to do. We the walking dead go about our way here in our assignment. Each of this each of us this week identify how we the walking dead display the power of God. Lazarus displayed the power of God. He didn't have any choice. We see in scripture others who showed uh God is the master of death. We see h how uh the show of power in God of God in in that and also in our resurrection. How do we know we show the power of God? You know that as well as I. We we live the life. We walk the walk. We talk the talk. We let everyone see the change that the power of God brings about in our lives. In essence, we all show the fruit of the spirit. Galatians 5:22 and 23. But the fruit of the spirit is love, joy, peace, forbearance, kindness, goodness, faithfulness, gentleness, and self-control. Against such things there is no law. What a wonderful world if everyone acted like this. What a wonderful world we are when we make this our lifestyle. And what a wonderful eternity as we live face to face with God and are just like this. Amen. Alrighty. I tell you what. Oh, let's let's get let's wrap this up here because I'm hungry. I'm hungry and ready ready to to have some grub. And you know these these uh Oh, there we go. Uh you know these these potlucks, they're so good. Lots of carbs. So I have to repent and be good after. But anyway, so just a just an add thought as we get ready to be dismissed. Uh, you know, I don't know what the Lord has in store for me here, uh, besides chemo and all that good stuff. So, I don't know how long my tenure will be here. But if you've never been immersed, if you've never been baptized, you know, we've baptized about 10 people so far here, myself and Nathaniel. If you've never done that and you want me to do it, might be it might be time to get around. All right. Yeah, it might be time to start. Okay. Well, we better hurry up here. Uh because that is uh you know, it's a big it's a big deal to me. And and I know that so many people don't think it's any big deal. All I know is is what I read. And what I read is, I'm going to obey. You know, the Lord said to do this. The Lord said you have to be born of water and spirit uh to be in his kingdom. You know, and and and it's all part of of your your heart and your mindset. Uh there's a a Keith Green song, you can be baptized so many times the fishes know you by name. And you know, but it is your heart. So, you know, do do come talk to us. I think there'll probably be a baptism class coming up before too long and and everything. So, yeah. Uh and and of course, the main the main qualification, you know, to be baptized here is to walk up to me and say, I believe that Jesus is the Christ, the son of the living God, you know, and we'll we'll get her done our gar. All right. All right. I'm hungry. Let's be standing. Our God and our father, I thank you for the privilege of being the messenger of your word. I thank you for this congregation, this good congregation, this loving congregation and and I thank you that uh we are indeed the household of faith. So now, holy father, we are going to gather for our uh fellowship. We pray that you'll bless the food to our nourishment. Bless the hands that have prepared it and also bless us as the transition team makes their big reveal and what all they've been up to and the and all this good stuff. So, Holy Father, bless us now. We pray in the precious name of Jesus. Amen. Amen. Your good, good father. It's who you are. It's who you are. It's who you are. And I'm loved by you. It's who I am. It's who I am. It's who I am. You're a good, good father. It's who you are. It's who you are. It's who you are. And I'm loved by you. It's who I am. It's who I am. It's who I am. [Music] See you across the street. Have a good week.",
    "id": "9oK2reI7NiM",
    "microformat": {
      "playerMicroformatRenderer": {
        "category": "Nonprofits & Activism",
        "description": {
          "simpleText": "Clinton Alliance Church\n1192 Centre Road \nRhinebeck, NY 12572\n\n845-266-5178 \n\nhttps://www.clintonalliance.church/ \n\n---------------------------------------------------------------------- \nSunday Worship Service - 10am \nCoffee Fellowship - 11am+ \n---------------------------------------------------------------------- \n\nWorship -  \nGood Good Father - 2:25  \nHe Keeps Me Singing - 6:37  \nHoly Holy Holy - 10:16  \nO Spirit of the Living God - 22:35\n\nCommunion - 17:26  \n\nCongregational Prayer - 27:16  \n\nMessage - Pastor Keith MacKey - 34:13  \n\n\nCCLI license 646157\nChristian Missionary Alliance, CMA, live, worship, service, prayer, scripture, sermon, Jesus, salvation, grace, music, songs, singing, prayer, Len Nelson, Bill Kopp, Paul Leitem, Alliance Worship Band, AWB, Dutchess County, Town of Clinton, Clinton Corners, Hyde Park, Pine Plains, Standfordville, upstate"
        },
        "externalChannelId": "UCnJkPvQ17L9JMsUN3AiGV3A",
        "lengthSeconds": "3650",
        "ownerChannelName": "ClintonAllianceChurch",
        "publishDate": "2025-11-03",
        "title": {
          "simpleText": "Clinton Alliance Church - November 2, 2025"
        }
      }
    },
    "isLive": false,
    "isLoginRequired": false,
    "languages": [
      {
        "label": "en",
        "languageCode": "en"
      }
    ],
    "playabilityStatus": {
      "status": "OK",
      "reason": ""
    },
    "title": "Clinton Alliance Church - November 2, 2025",
    "tracks": [
      {
        "language": "en",
        "transcript": [
          {
            "start": "0",
            "dur": "8.049",
            "text": "[Music]"
          },
          {
            "start": "10",
            "dur": "38.889",
            "text": "Congratulations. [Music]"
          },
          {
            "start": "49.44",
            "dur": "6.88",
            "text": "Good morning everyone. Welcome to morning worship. First Sunday of the month, communion uh Sunday this morning"
          },
          {
            "start": "56.32",
            "dur": "6.399",
            "text": "and brunch fellowship afterwards. So we're glad you're here. We're celebrating our opening song. We're"
          },
          {
            "start": "62.719",
            "dur": "6.4",
            "text": "celebrating our good good father who loves us beyond measure. Matter of fact, I'm the greeting elder today. So, I'll"
          },
          {
            "start": "69.119",
            "dur": "5.201",
            "text": "be in the pastor's office uh briefly afterwards if uh anyone would like some"
          },
          {
            "start": "74.32",
            "dur": "6.56",
            "text": "one-on-one prayer. Our opening scripture this morning, I'm going to do this u we normally do it after the opening song,"
          },
          {
            "start": "80.88",
            "dur": "8.08",
            "text": "but this is from First John chapter 3. It's on page about 12 29 in your Bibles."
          },
          {
            "start": "88.96",
            "dur": "6.159",
            "text": "John says this, \"See what great love the father has lavished on us that we should"
          },
          {
            "start": "95.119",
            "dur": "6.721",
            "text": "be called children of God.\" And that is what we are. The reason the world does"
          },
          {
            "start": "101.84",
            "dur": "6.72",
            "text": "not know us is that it did not know him. Dear friends, now we are children of"
          },
          {
            "start": "108.56",
            "dur": "6.72",
            "text": "God, and what we will be has not yet been made known. But we know that when"
          },
          {
            "start": "115.28",
            "dur": "7.839",
            "text": "Christ appears, we shall be like him, for we shall see him as he is. Amen. All"
          },
          {
            "start": "123.119",
            "dur": "10.241",
            "text": "who have this hope in him purify themselves just as he is pure. So, amen"
          },
          {
            "start": "133.36",
            "dur": "5.76",
            "text": "to that. We are children of God. I'm going to heaven. How about you?"
          },
          {
            "start": "139.12",
            "dur": "7.72",
            "text": "Amen. Amen. Let's uh worship the father together this morning."
          },
          {
            "start": "148.11",
            "dur": "8.1",
            "text": "[Music]"
          },
          {
            "start": "157.84",
            "dur": "6.24",
            "text": "Oh, I've heard thousand stories of what"
          },
          {
            "start": "164.08",
            "dur": "5.519",
            "text": "they think you're like, but I've heard"
          },
          {
            "start": "169.599",
            "dur": "10.481",
            "text": "the tender whisper of love. the dead of night. And you tell me that"
          },
          {
            "start": "180.08",
            "dur": "7.92",
            "text": "you're pleased and head out. Never alone. You're a good father. It's who"
          },
          {
            "start": "188",
            "dur": "5.04",
            "text": "you are. It's who you are. It's who you"
          },
          {
            "start": "193.04",
            "dur": "11.919",
            "text": "are. And I'm loved by you. It's who I am. It's who I am. It's who I am."
          },
          {
            "start": "204.959",
            "dur": "7.441",
            "text": "Oh, I've seen many searching for answers"
          },
          {
            "start": "212.4",
            "dur": "5.759",
            "text": "far and wide. But I know we're all"
          },
          {
            "start": "218.159",
            "dur": "8.961",
            "text": "searching for answers. Only you provide. Cuz you know just what"
          },
          {
            "start": "227.12",
            "dur": "5.119",
            "text": "we need. Before we say a word, you're a"
          },
          {
            "start": "232.239",
            "dur": "9.121",
            "text": "good, good, Father. It's who you are. It's who you are. It's who you are. And"
          },
          {
            "start": "241.36",
            "dur": "10.159",
            "text": "I'm loved by you. It's who I am. It's who I am. It's who I am."
          },
          {
            "start": "251.519",
            "dur": "9.44",
            "text": "You are perfect in all of your ways. You are perfect in all of your ways."
          },
          {
            "start": "260.959",
            "dur": "5.361",
            "text": "You are perfect in all of your ways to"
          },
          {
            "start": "266.32",
            "dur": "8.72",
            "text": "us. You are perfect in all of your ways."
          },
          {
            "start": "275.04",
            "dur": "10.159",
            "text": "You are perfect in all of your ways. You are perfect in all of your ways. to"
          },
          {
            "start": "285.199",
            "dur": "7.44",
            "text": "us. Oh, it's love so"
          },
          {
            "start": "292.639",
            "dur": "9.361",
            "text": "undeniable. I can hardly speak, be so"
          },
          {
            "start": "302",
            "dur": "9.28",
            "text": "unexplainable. I can hardly think as you call me."
          },
          {
            "start": "311.28",
            "dur": "9.359",
            "text": "Deeper still as you call. Deeper still as you call."
          },
          {
            "start": "320.639",
            "dur": "5.28",
            "text": "Deeper still into love. Love. Love."
          },
          {
            "start": "325.919",
            "dur": "9.28",
            "text": "You're a good good father. It's who you are. It's who you are. It's who you are."
          },
          {
            "start": "335.199",
            "dur": "10.72",
            "text": "And I'm loved by you. It's who I am. It's who I am. It's who I am. Your good,"
          },
          {
            "start": "345.919",
            "dur": "9.441",
            "text": "good father. It's who you are. It's who you are. It's who you are. And I'm loved"
          },
          {
            "start": "355.36",
            "dur": "6",
            "text": "by you. It's who I am. It's who I am."
          },
          {
            "start": "361.36",
            "dur": "6.08",
            "text": "It's who I am. Father God, we just thank you for this"
          },
          {
            "start": "367.44",
            "dur": "6.72",
            "text": "morning. Thank you for this morning of life, for the air we have in our lungs and for uh the beautiful day that we"
          },
          {
            "start": "374.16",
            "dur": "7.28",
            "text": "enjoy. Thank you for your marvelous creation and for this family of Christ that meets in this place. Lord, be with"
          },
          {
            "start": "381.44",
            "dur": "5.599",
            "text": "us today. Inhabit our praises with your Holy Spirit as we lift the name of"
          },
          {
            "start": "387.039",
            "dur": "7.761",
            "text": "Jesus. And everyone said, \"Amen.\" Amen. Let's stand and celebrate"
          },
          {
            "start": "394.8",
            "dur": "12.679",
            "text": "how the Lord keeps us going day by day. [Music]"
          },
          {
            "start": "407.6",
            "dur": "8.24",
            "text": "Jesus, Jesus, Jesus, sweetest name I know"
          },
          {
            "start": "415.84",
            "dur": "9.24",
            "text": "fills my every longing. Teach me sing as I go."
          },
          {
            "start": "426.319",
            "dur": "8.401",
            "text": "There's within my heart a meloy. Jesus whispers sweet and low."
          },
          {
            "start": "434.72",
            "dur": "8.479",
            "text": "Fear not. I am with thee. Peace be still. In all of life and flow."
          },
          {
            "start": "443.199",
            "dur": "6.161",
            "text": "All my life was wrecked by sin and strife. Breath fulfilled my life with"
          },
          {
            "start": "449.36",
            "dur": "6.399",
            "text": "pain. Jesus wept across the broken stream."
          },
          {
            "start": "455.759",
            "dur": "8.481",
            "text": "Stir the stumbling cords again. Jesus. Jesus. Jesus."
          },
          {
            "start": "464.24",
            "dur": "8.16",
            "text": "Sweetest name I know. Fill my every longing."
          },
          {
            "start": "472.4",
            "dur": "6.519",
            "text": "He keeps me singing as I go. Feasting"
          },
          {
            "start": "479.44",
            "dur": "6.81",
            "text": "on the riches of his grace, resting his sheltering wings."
          },
          {
            "start": "486.25",
            "dur": "5.349",
            "text": "[Music] Always looking on his smile and faith."
          },
          {
            "start": "491.599",
            "dur": "6.32",
            "text": "That is why I shout and sing. Though sometimes he leads through the"
          },
          {
            "start": "497.919",
            "dur": "6.241",
            "text": "waters deep, trials fall across my way."
          },
          {
            "start": "504.16",
            "dur": "6.08",
            "text": "Though sometimes the past seems rough and steep, see his footprints all the"
          },
          {
            "start": "510.24",
            "dur": "6.64",
            "text": "way. Jesus, Jesus, Jesus,"
          },
          {
            "start": "516.88",
            "dur": "8.16",
            "text": "sweetest name I know. Fills my every longing."
          },
          {
            "start": "525.04",
            "dur": "5.239",
            "text": "He keeps me singing as I go."
          },
          {
            "start": "531.68",
            "dur": "8.32",
            "text": "Soon he's coming back to welcome me far beyond the starry sky."
          },
          {
            "start": "540",
            "dur": "8.48",
            "text": "I shall wing my flight to world unknown. I shall ring with him on high. Sing it."
          },
          {
            "start": "548.48",
            "dur": "5.08",
            "text": "Jesus Jesus Jesus"
          },
          {
            "start": "553.68",
            "dur": "7.12",
            "text": "name I know. fulfills my every longing"
          },
          {
            "start": "560.8",
            "dur": "8.64",
            "text": "and keeps me singing as I go. Jesus, Jesus, Jesus,"
          },
          {
            "start": "569.44",
            "dur": "8.48",
            "text": "sweetest name I know. Fills my every longing."
          },
          {
            "start": "577.92",
            "dur": "5",
            "text": "Keep me singing as I go."
          },
          {
            "start": "585.36",
            "dur": "7.28",
            "text": "Say good morning to somebody next to you this morning. Jesus, Jesus, Jesus,"
          },
          {
            "start": "592.64",
            "dur": "8.36",
            "text": "sweetest name I know. Build my every"
          },
          {
            "start": "601.36",
            "dur": "9.409",
            "text": "me singing as I go. [Music]"
          },
          {
            "start": "618.1",
            "dur": "11.799",
            "text": "[Music] [Applause] [Music]"
          },
          {
            "start": "634.32",
            "dur": "10",
            "text": "Holy, holy, holy. Holy, holy, holy,"
          },
          {
            "start": "644.32",
            "dur": "6.67",
            "text": "holy is the Lord God Almighty."
          },
          {
            "start": "650.99",
            "dur": "8.289",
            "text": "[Music] Worthy to receive glory."
          },
          {
            "start": "659.279",
            "dur": "5.041",
            "text": "Worthy to receive honor."
          },
          {
            "start": "664.32",
            "dur": "6.8",
            "text": "worthy to receive all our praise"
          },
          {
            "start": "671.12",
            "dur": "8.159",
            "text": "today. [Music] Holy, holy, holy,"
          },
          {
            "start": "679.279",
            "dur": "5.041",
            "text": "holy, holy, holy,"
          },
          {
            "start": "684.32",
            "dur": "7.32",
            "text": "holy is the Lord God Almighty."
          },
          {
            "start": "694.32",
            "dur": "9.92",
            "text": "Worthy to receive gloryy. Worthy to receive honor."
          },
          {
            "start": "704.24",
            "dur": "6.88",
            "text": "Worthy to receive all our praise"
          },
          {
            "start": "711.12",
            "dur": "5.52",
            "text": "today. Praise"
          },
          {
            "start": "716.64",
            "dur": "7.52",
            "text": "him. Praise him and lift him up."
          },
          {
            "start": "724.16",
            "dur": "9.52",
            "text": "Praise him. Exalt his name forever."
          },
          {
            "start": "733.68",
            "dur": "5.52",
            "text": "Oh, praise him."
          },
          {
            "start": "739.2",
            "dur": "7.439",
            "text": "Praise him and lift him up. Praise"
          },
          {
            "start": "746.639",
            "dur": "6.211",
            "text": "him. Exalt his name forever."
          },
          {
            "start": "752.85",
            "dur": "8.989",
            "text": "[Music] Holy, holy, holy,"
          },
          {
            "start": "761.839",
            "dur": "8.641",
            "text": "holy, holy, holy, holy is the Lord"
          },
          {
            "start": "770.48",
            "dur": "3.719",
            "text": "God Almighty."
          },
          {
            "start": "776.88",
            "dur": "9.199",
            "text": "Worthy to receive glory. Worthy to receive honor."
          },
          {
            "start": "786.079",
            "dur": "7.601",
            "text": "Oh, he's worthy to receive all our praise"
          },
          {
            "start": "793.68",
            "dur": "5.44",
            "text": "today. [Music] Praise [Music]"
          },
          {
            "start": "799.12",
            "dur": "7.6",
            "text": "him. [Music] Praise him and lift him up."
          },
          {
            "start": "806.72",
            "dur": "9.44",
            "text": "Praise him. Exalt his name forever."
          },
          {
            "start": "816.16",
            "dur": "5.52",
            "text": "Oh, praise him. [Applause]"
          },
          {
            "start": "821.68",
            "dur": "7.44",
            "text": "Praise him and lift him up. Praise"
          },
          {
            "start": "829.12",
            "dur": "7.3",
            "text": "him. Exalt his name forever."
          },
          {
            "start": "836.42",
            "dur": "7.9",
            "text": "[Music] Holy, holy, holy,"
          },
          {
            "start": "844.32",
            "dur": "5.04",
            "text": "holy, holy, holy,"
          },
          {
            "start": "849.36",
            "dur": "7.32",
            "text": "holy is the Lord God Almighty."
          },
          {
            "start": "859.36",
            "dur": "8.64",
            "text": "worthy to receive glory. He's worthy to receive honor."
          },
          {
            "start": "868",
            "dur": "5.04",
            "text": "[Music] Worthy to receive"
          },
          {
            "start": "873.04",
            "dur": "6.12",
            "text": "all our praise today."
          },
          {
            "start": "879.199",
            "dur": "9.921",
            "text": "Praise him. [Music] Praise him and lift him up."
          },
          {
            "start": "889.12",
            "dur": "9.6",
            "text": "Praise him. Exalt his name forever."
          },
          {
            "start": "898.72",
            "dur": "5.44",
            "text": "Oh, praise him."
          },
          {
            "start": "904.16",
            "dur": "7.52",
            "text": "Praise him and lift him up. Praise"
          },
          {
            "start": "911.68",
            "dur": "5.41",
            "text": "him. Exalt his name forever."
          },
          {
            "start": "917.09",
            "dur": "7.07",
            "text": "[Music] Oh, praise him."
          },
          {
            "start": "924.16",
            "dur": "5.039",
            "text": "Praise him and lift him up."
          },
          {
            "start": "929.199",
            "dur": "8.641",
            "text": "Praise him. Exalt his name forever."
          },
          {
            "start": "937.84",
            "dur": "6.32",
            "text": "[Music]"
          },
          {
            "start": "944.16",
            "dur": "3.88",
            "text": "Good morning. You can be seated."
          },
          {
            "start": "951.6",
            "dur": "5.52",
            "text": "Thank you, Lord. Couple of announcements this morning. If you're visiting with us for the first"
          },
          {
            "start": "957.12",
            "dur": "5.68",
            "text": "time, man, you hit into it today. Brunch fellowship going across the street today"
          },
          {
            "start": "962.8",
            "dur": "5.44",
            "text": "in the youth center. So, join us before you go home. I'll be in the pastor's office for the first little while."
          },
          {
            "start": "968.24",
            "dur": "5.2",
            "text": "Operation Christmas Child. I know the boxes are out. I think they're in the"
          },
          {
            "start": "973.44",
            "dur": "6.399",
            "text": "foyer and I think they're across the street. So, we'll be gathering those boxes and there's uh explanations there"
          },
          {
            "start": "979.839",
            "dur": "7.36",
            "text": "if you haven't done it before. And uh that'll be due on the 16th, which is just what a couple weeks away. Pie and"
          },
          {
            "start": "987.199",
            "dur": "6.401",
            "text": "praise, one of my favorite gatherings by the way, will be on the 23rd."
          },
          {
            "start": "993.6",
            "dur": "8.96",
            "text": "Stippers will be hosting that. That'll be at 6:30 right here in this space. Amen. is going to BA Baptist uh the end"
          },
          {
            "start": "1002.56",
            "dur": "6.56",
            "text": "of the month. Rich Bead is the person to talk to about that. Did somebody had"
          },
          {
            "start": "1009.12",
            "dur": "6.12",
            "text": "something they wanted to mention this morning that I have forgotten? Go ahead, Rich."
          },
          {
            "start": "1017.44",
            "dur": "6.56",
            "text": "Okay. All right. So, boxes for socks are here and down below. They bring those to Bula"
          },
          {
            "start": "1024",
            "dur": "5.6",
            "text": "and along with helping to serve the food. So, there we go. Uh right now"
          },
          {
            "start": "1029.6",
            "dur": "5.599",
            "text": "we're going to release the kids for junior church. They can go ahead as we get ready for communion. Pastor will"
          },
          {
            "start": "1035.199",
            "dur": "4.281",
            "text": "come. Good morning, Pastor Keith."
          },
          {
            "start": "1041.52",
            "dur": "4.76",
            "text": "All right. Oh, there we go."
          },
          {
            "start": "1047.36",
            "dur": "6.039",
            "text": "As the thundering herd makes its way out the out the door"
          },
          {
            "start": "1053.6",
            "dur": "5.04",
            "text": "and we prepare our hearts for communion. So, I need a couple of elders front and"
          },
          {
            "start": "1058.64",
            "dur": "6",
            "text": "center. Whoever did we think about who was doing that today? We didn't. We did not. Did we? All right. Here"
          },
          {
            "start": "1064.64",
            "dur": "6.56",
            "text": "comes Allan. Uh Allan, come forth. And And here's here comes uh Lenny."
          },
          {
            "start": "1071.2",
            "dur": "7.839",
            "text": "Well, we got one side covered. Now, we need to get the other side covered. So, uh somebody come forth. You know,"
          },
          {
            "start": "1079.039",
            "dur": "8.561",
            "text": "there's a there is a big threat I could give here. There are churches who have uh women serve communion."
          },
          {
            "start": "1087.6",
            "dur": "7.36",
            "text": "We could threaten them with that, couldn't we? Which I don't really think is a threat. But anyway, neither here nor there. Want"
          },
          {
            "start": "1094.96",
            "dur": "8",
            "text": "to talk a talk a minute here, of course, to 1 Corinthians 11."
          },
          {
            "start": "1102.96",
            "dur": "5.92",
            "text": "The Lord Jesus on the night he was betrayed took bread and when he had given thanks, he broke it and said,"
          },
          {
            "start": "1108.88",
            "dur": "6.159",
            "text": "\"This is my body which is for you. Do this in remembrance of me.\" In the same"
          },
          {
            "start": "1115.039",
            "dur": "7.041",
            "text": "way, after supper, he took the cup, saying, \"This cup is the new covenant in my blood. Do this whenever you drink of"
          },
          {
            "start": "1122.08",
            "dur": "7.28",
            "text": "it in remembrance of me.\" You know, this is the most holy and"
          },
          {
            "start": "1129.36",
            "dur": "5.12",
            "text": "sacred part of our time together today. and and this time we come together"
          },
          {
            "start": "1134.48",
            "dur": "5.36",
            "text": "around uh the Lord's table and partake of the Lord's supper. And there is some"
          },
          {
            "start": "1139.84",
            "dur": "6.8",
            "text": "heavy symbolism here. Uh our table in most Protestant churches uh resembles"
          },
          {
            "start": "1146.64",
            "dur": "6.399",
            "text": "not the actual table that the Lord and his disciples gathered around, but rather something out of a Michelangelo"
          },
          {
            "start": "1153.039",
            "dur": "7.921",
            "text": "painting. Uh in fact, that very very famous painting uh of the Lord's supper is horribly incorrect."
          },
          {
            "start": "1160.96",
            "dur": "5.839",
            "text": "But you know what? That's not important. Our our bread and this little cup has"
          },
          {
            "start": "1166.799",
            "dur": "7.201",
            "text": "little if any physical resemblance to that which Jesus and his disciples parttook of uh during that Passover"
          },
          {
            "start": "1174",
            "dur": "6.48",
            "text": "feast. But you know what? That's not important. What is important is that we the"
          },
          {
            "start": "1180.48",
            "dur": "6.319",
            "text": "followers of Christ gather here at this place and we partake of this unleavened"
          },
          {
            "start": "1186.799",
            "dur": "7.361",
            "text": "bread which is called and that which is called the fruit of the vine. And we do so in the memory of Jesus, remembering"
          },
          {
            "start": "1194.16",
            "dur": "6",
            "text": "him and all that he has done for us. And that's what's important."
          },
          {
            "start": "1200.16",
            "dur": "6.879",
            "text": "Where are our minds this morning? I pray that it's on Jesus. And if Jesus is your"
          },
          {
            "start": "1207.039",
            "dur": "5.041",
            "text": "savior, please partake with us. Uh, one of the guys will come and pray and then"
          },
          {
            "start": "1212.08",
            "dur": "5.92",
            "text": "we will pass the bread out and hold on to it. We will partake of it together. And the same with the cup. Uh, one of"
          },
          {
            "start": "1218",
            "dur": "6.48",
            "text": "the guys will pray for the cup, then we will pass it out, and then we will partake of it together, all the while"
          },
          {
            "start": "1224.48",
            "dur": "7.079",
            "text": "remembering our awesome Lord Jesus. Gentlemen,"
          },
          {
            "start": "1234.64",
            "dur": "5.039",
            "text": "let's give thanks for the bread. Dear Father, we thank you for today,"
          },
          {
            "start": "1239.679",
            "dur": "6.081",
            "text": "this particular time that we think of what you did for us."
          },
          {
            "start": "1245.76",
            "dur": "5.68",
            "text": "And we pray that that would have an impact on us every day."
          },
          {
            "start": "1251.44",
            "dur": "5.84",
            "text": "And if um there's somebody here who hasn't made that decision yet, we pray that they'd be nudged closer to"
          },
          {
            "start": "1257.28",
            "dur": "7.04",
            "text": "considering it because it's uh affects one's life for now and for eternity."
          },
          {
            "start": "1264.32",
            "dur": "5.68",
            "text": "Thank you again for giving your body up for us. Jesus name. Amen."
          },
          {
            "start": "1270",
            "dur": "4.84",
            "text": "Let us partake together of the body of Christ."
          },
          {
            "start": "1284.72",
            "dur": "6.8",
            "text": "Let us pray. Dear Lord, it says there is no remission of sin without the shedding of blood. We thank you for giving us"
          },
          {
            "start": "1291.52",
            "dur": "7.36",
            "text": "your son and shedding his blood to pay for our sins so that we may have life beyond this world. Help us to examine"
          },
          {
            "start": "1298.88",
            "dur": "6.56",
            "text": "ourselves, see how we can do better to serve him and serve others, Lord, as he did while he was here. His name we pray."
          },
          {
            "start": "1305.44",
            "dur": "6.239",
            "text": "Amen. Amen. And in the name of Jesus, we participate"
          },
          {
            "start": "1311.679",
            "dur": "5.441",
            "text": "in the cup represents the blood of our Jesus which seals the covenant that"
          },
          {
            "start": "1317.12",
            "dur": "5.16",
            "text": "ensures our salvation. Let us partake."
          },
          {
            "start": "1330.4",
            "dur": "5.07",
            "text": "Thank you, brothers. [Music]"
          },
          {
            "start": "1336.32",
            "dur": "7.88",
            "text": "Our last song of worship before we go to uh congregational prayer and pastor comes."
          },
          {
            "start": "1344.24",
            "dur": "8.319",
            "text": "One from uh 1933. kind of a monastic kind of a chant."
          },
          {
            "start": "1352.559",
            "dur": "4.441",
            "text": "Oh spirit of the living God."
          },
          {
            "start": "1360.48",
            "dur": "10.4",
            "text": "[Music]"
          },
          {
            "start": "1370.88",
            "dur": "5.039",
            "text": "Oh spirit of the livinging"
          },
          {
            "start": "1375.919",
            "dur": "7.401",
            "text": "God, thou light and fire divine."
          },
          {
            "start": "1383.36",
            "dur": "8",
            "text": "Descend upon thy church once more and make it"
          },
          {
            "start": "1391.36",
            "dur": "10.48",
            "text": "truly thine. Fill it with love and joy and power,"
          },
          {
            "start": "1401.84",
            "dur": "6.079",
            "text": "with rightuousness [Music] and peace,"
          },
          {
            "start": "1407.919",
            "dur": "5.281",
            "text": "till Christ shall dwell in human"
          },
          {
            "start": "1413.2",
            "dur": "7.44",
            "text": "hearts and sin and sorrow cease."
          },
          {
            "start": "1420.64",
            "dur": "6.039",
            "text": "Oh, oh,"
          },
          {
            "start": "1426.72",
            "dur": "6.16",
            "text": "oh. [Music]"
          },
          {
            "start": "1432.88",
            "dur": "7.84",
            "text": "Blow wind of God with wisdom blow until"
          },
          {
            "start": "1440.72",
            "dur": "11.12",
            "text": "our minds are free [Music] from midst of their clouds of hell which"
          },
          {
            "start": "1451.84",
            "dur": "5.76",
            "text": "blind our eyes to thee."
          },
          {
            "start": "1457.6",
            "dur": "6.559",
            "text": "Burn wing it fire. Inspire our lips with"
          },
          {
            "start": "1464.159",
            "dur": "5.76",
            "text": "flameing love and z"
          },
          {
            "start": "1469.919",
            "dur": "6.081",
            "text": "to preach to all the bravehood"
          },
          {
            "start": "1476",
            "dur": "6.32",
            "text": "God's glorious common will."
          },
          {
            "start": "1482.32",
            "dur": "6.08",
            "text": "Oh wo. [Music] Oh woah."
          },
          {
            "start": "1488.4",
            "dur": "6.15",
            "text": "Oh woah. [Music]"
          },
          {
            "start": "1494.559",
            "dur": "5.041",
            "text": "Teach us to other livinging"
          },
          {
            "start": "1499.6",
            "dur": "7.36",
            "text": "words with truth which all may hear."
          },
          {
            "start": "1506.96",
            "dur": "6",
            "text": "The language all may understand."
          },
          {
            "start": "1512.96",
            "dur": "6.079",
            "text": "When love speaks loud and clear [Music]"
          },
          {
            "start": "1519.039",
            "dur": "6.64",
            "text": "till every age and race and climb shall"
          },
          {
            "start": "1525.679",
            "dur": "5.841",
            "text": "blend their cre as one."
          },
          {
            "start": "1531.52",
            "dur": "6.08",
            "text": "And earth shall form one family"
          },
          {
            "start": "1537.6",
            "dur": "6.24",
            "text": "by whom thy will is done."
          },
          {
            "start": "1543.84",
            "dur": "12.028",
            "text": "Oh, [Music]"
          },
          {
            "start": "1556",
            "dur": "7.12",
            "text": "so shall we know the power of Christ who"
          },
          {
            "start": "1563.12",
            "dur": "5.84",
            "text": "came this world to save. [Music]"
          },
          {
            "start": "1568.96",
            "dur": "6.8",
            "text": "So shall we rise with him to light with"
          },
          {
            "start": "1575.76",
            "dur": "6.12",
            "text": "so beyond the grave."
          },
          {
            "start": "1581.919",
            "dur": "6.081",
            "text": "And I shall with true holyness"
          },
          {
            "start": "1588",
            "dur": "5.08",
            "text": "and faith thy children."
          },
          {
            "start": "1594",
            "dur": "8.24",
            "text": "Till perfected by thee we reach creation's"
          },
          {
            "start": "1602.24",
            "dur": "7.2",
            "text": "glorious go. Oh."
          },
          {
            "start": "1609.44",
            "dur": "5.13",
            "text": "Oh. [Music] Oh."
          },
          {
            "start": "1614.57",
            "dur": "7.229",
            "text": "[Music] Oh."
          },
          {
            "start": "1621.84",
            "dur": "5.34",
            "text": "Oh. Oh."
          },
          {
            "start": "1627.18",
            "dur": "10.46",
            "text": "[Music]"
          },
          {
            "start": "1638",
            "dur": "5.919",
            "text": "Thank you, Lord. When the perfect shall come, the temporary will pass away. We"
          },
          {
            "start": "1643.919",
            "dur": "5.281",
            "text": "will see you face to face, no longer in a mirror, dimly,"
          },
          {
            "start": "1649.2",
            "dur": "6.64",
            "text": "but in your presence. What a joy it will be to stand before Christ in that day."
          },
          {
            "start": "1655.84",
            "dur": "5.76",
            "text": "Some of us have already passed. The saints who have gone before. Those of us"
          },
          {
            "start": "1661.6",
            "dur": "6.16",
            "text": "who remain, we carry the name of Christ until the day we die. We proclaim him"
          },
          {
            "start": "1667.76",
            "dur": "8.24",
            "text": "and him alone who brings glory and honor and praise to you God the Father in"
          },
          {
            "start": "1676",
            "dur": "7.279",
            "text": "Jesus name. We do have some prayer requests we need to uh go over this morning and pastor uh"
          },
          {
            "start": "1683.279",
            "dur": "6.64",
            "text": "going to just speak speak a word here before we go to that. All righty."
          },
          {
            "start": "1689.919",
            "dur": "5.12",
            "text": "Well, yes, something I wanted to to say as we get into uh prayer time and I"
          },
          {
            "start": "1695.039",
            "dur": "7.76",
            "text": "wanted me to be the one uh announcing it. And finally, at long last, we have"
          },
          {
            "start": "1702.799",
            "dur": "5.441",
            "text": "answers to the uh all the biopsies and tests and all that good stuff. And and"
          },
          {
            "start": "1708.24",
            "dur": "7.2",
            "text": "and I have uh as I've said several times, I have good news and bad news."
          },
          {
            "start": "1715.44",
            "dur": "6",
            "text": "The good news is it's treatable with chemo. The bad news is I seem to have"
          },
          {
            "start": "1721.44",
            "dur": "6.239",
            "text": "inherited B cell lymphoma. So yeah, that's called cancer. So, yes,"
          },
          {
            "start": "1727.679",
            "dur": "6.161",
            "text": "I have cancer. And so, now my next little bit will be treating that. And"
          },
          {
            "start": "1733.84",
            "dur": "8",
            "text": "and and I'm still don't really know what all that's going to entail because I haven't met with the uh with the uh the"
          },
          {
            "start": "1741.84",
            "dur": "5.28",
            "text": "proper doctors yet, the oncologist, and that'll be week after next, and then"
          },
          {
            "start": "1747.12",
            "dur": "5.919",
            "text": "we'll kind of be able to map things out. So anyway, yes, your pastor has cancer"
          },
          {
            "start": "1753.039",
            "dur": "5.921",
            "text": "and and but no, I tell you what. So now my goal is to join the legion of people"
          },
          {
            "start": "1758.96",
            "dur": "6.4",
            "text": "who are cancer survivors and I'm going to do that if the Lord"
          },
          {
            "start": "1765.36",
            "dur": "7.72",
            "text": "lets me. Otherwise, the Lord may have accepted my application to go to the home office."
          },
          {
            "start": "1773.2",
            "dur": "7.04",
            "text": "And and when you really think about that, is that so bad? You know, is that really so bad? It's not. It's it's just"
          },
          {
            "start": "1780.24",
            "dur": "7.6",
            "text": "fine. So anyway, I do covet your prayers. There have been many prayers lifted up. Uh but I covet many more"
          },
          {
            "start": "1787.84",
            "dur": "5.199",
            "text": "prayers and we will see what the future will hold. Amen."
          },
          {
            "start": "1793.039",
            "dur": "5.12",
            "text": "Thank you, Paul. Amen. And you're not leaving here one day sooner than he ordains."
          },
          {
            "start": "1798.159",
            "dur": "7.041",
            "text": "That's that's true. That's true. All of us uh can take comfort in that. We'll be we'll be laying hands on pastor"
          },
          {
            "start": "1805.2",
            "dur": "9.28",
            "text": "down below uh today during fellowship time. going to read uh to go along with our uh praise to God the Father today,"
          },
          {
            "start": "1814.48",
            "dur": "9.36",
            "text": "the end of the the passage of uh the prodigal son. And uh this is in Luke 15"
          },
          {
            "start": "1823.84",
            "dur": "5.12",
            "text": "uh starting in verse 18. The boy when he finally comes to himself, he says, \"I"
          },
          {
            "start": "1828.96",
            "dur": "7.36",
            "text": "will set out and go back to my father and say to him, Father, I have sinned against heaven and against you. I am no"
          },
          {
            "start": "1836.32",
            "dur": "6.079",
            "text": "longer worthy to be called your son. Make me like one of your hired servants."
          },
          {
            "start": "1842.399",
            "dur": "6",
            "text": "And so he got up and went to his father. But while he was still a long way off,"
          },
          {
            "start": "1848.399",
            "dur": "5.841",
            "text": "his father saw him and was filled with compassion for him and he ran to his"
          },
          {
            "start": "1854.24",
            "dur": "5.439",
            "text": "son, threw his arms around him and kissed him."
          },
          {
            "start": "1859.679",
            "dur": "6.801",
            "text": "You know the the culture of the day, the father would never run. number one"
          },
          {
            "start": "1866.48",
            "dur": "6.799",
            "text": "and he would especially never run to a son who had been um who who had been"
          },
          {
            "start": "1873.279",
            "dur": "6.321",
            "text": "separated from him and in a life of sin. But here we see a picture of God the"
          },
          {
            "start": "1879.6",
            "dur": "7.36",
            "text": "Father u running to us, throwing his arms around us and kissing us. Amen."
          },
          {
            "start": "1886.96",
            "dur": "5.199",
            "text": "What a what a good uh what a good passage. Thank you, Lord. We do want to"
          },
          {
            "start": "1892.159",
            "dur": "5.12",
            "text": "uh we're we're going to add Pastor Keith to our list of people that were praying"
          },
          {
            "start": "1897.279",
            "dur": "8.721",
            "text": "uh for cancer which include uh Jim, Jim Jr. Stuart, Kristen, Debbie, uh Teresa,"
          },
          {
            "start": "1906",
            "dur": "5.039",
            "text": "and Denise. Father, we do lift all these before you as well as our pastor this"
          },
          {
            "start": "1911.039",
            "dur": "7.601",
            "text": "morning. What a dreaded disease that uh humanity has upon it. But um Lord, the"
          },
          {
            "start": "1918.64",
            "dur": "6.8",
            "text": "the disease of sin is much worse and much and uh totally fatal. Not only"
          },
          {
            "start": "1925.44",
            "dur": "5.04",
            "text": "separating us from this physical life, but separating from you and all that is"
          },
          {
            "start": "1930.48",
            "dur": "5.52",
            "text": "good. Thank you, Jesus, for dying in our place that we might have life and have"
          },
          {
            "start": "1936",
            "dur": "5.519",
            "text": "it eternal. We do pray for our church, for leaders, for the uh the various"
          },
          {
            "start": "1941.519",
            "dur": "5.76",
            "text": "teams that are in place right now uh getting ready for pastor next. And we"
          },
          {
            "start": "1947.279",
            "dur": "6",
            "text": "just pray that uh you have gone before us and prepared that person and prepare"
          },
          {
            "start": "1953.279",
            "dur": "6.481",
            "text": "those who will be calling him uh to have discernment and wisdom and the guidance"
          },
          {
            "start": "1959.76",
            "dur": "5.36",
            "text": "of your spirit. And do Lord, we also pray for our country, for our leaders,"
          },
          {
            "start": "1965.12",
            "dur": "7.12",
            "text": "everyone from local up to federal uh guide and protect them uh and work your"
          },
          {
            "start": "1972.24",
            "dur": "6.559",
            "text": "will uh in this mess that we are in. Uh we need your help, Lord, in in a big"
          },
          {
            "start": "1978.799",
            "dur": "5.441",
            "text": "way. uh not that you are unaware of it, but uh we would pray that as a country"
          },
          {
            "start": "1984.24",
            "dur": "6.159",
            "text": "that we would repent and uh and turn our hearts toward uh the God of our making"
          },
          {
            "start": "1990.399",
            "dur": "6",
            "text": "and um and and serve you with our hearts. Protect our leaders, Lord. We"
          },
          {
            "start": "1996.399",
            "dur": "6.481",
            "text": "also pray for uh all those in harm's way. Uh the people who are in uh the military, people who are first"
          },
          {
            "start": "2002.88",
            "dur": "7.36",
            "text": "responders, our police, uh all those uh valuable lives that uh seek to help"
          },
          {
            "start": "2010.24",
            "dur": "5.919",
            "text": "those who are in need. God bless them, protect them, and uh help them in their"
          },
          {
            "start": "2016.159",
            "dur": "6.4",
            "text": "mission. Lord, we we give this day to you. This is the the Lord's day, the first day of"
          },
          {
            "start": "2022.559",
            "dur": "7.761",
            "text": "the week. Early on the first day of the week, they came to the tomb and the tomb was empty. Thank you, Jesus, that you"
          },
          {
            "start": "2030.32",
            "dur": "5.28",
            "text": "are a living savior seated at the right hand of the father, interceding for us"
          },
          {
            "start": "2035.6",
            "dur": "5.12",
            "text": "as we speak this morning. We just ask you now that you would uh give pastor"
          },
          {
            "start": "2040.72",
            "dur": "8.8",
            "text": "the words this morning to uh preach from your word and deliver it with uh conviction and love in Jesus precious"
          },
          {
            "start": "2049.52",
            "dur": "7.04",
            "text": "name. Amen. Amen. All right. Thank you. Good morning, pastor. Good morning. And it is a good morning."
          },
          {
            "start": "2056.56",
            "dur": "7.119",
            "text": "Bright sunshine, the temperatures uh well, not as good as in Phoenix, but uh"
          },
          {
            "start": "2063.679",
            "dur": "5.679",
            "text": "you know, one thing I've noticed some I check the actuarial tables and and as I"
          },
          {
            "start": "2069.359",
            "dur": "8.961",
            "text": "look at it, I see that uh that uh it the fatality rate for humanity is 100%."
          },
          {
            "start": "2078.32",
            "dur": "6.838",
            "text": "So, think about it. None of you are getting out of here alive."
          },
          {
            "start": "2086.079",
            "dur": "6.721",
            "text": "Although it may not be. It'll be sooner or later. Hopefully later. All right. But anyway, uh you know, don't be shy to"
          },
          {
            "start": "2092.8",
            "dur": "6.319",
            "text": "come up to me and ask me about all this. That's all right. I'm a big boy. I can handle it. You want to come up and ask,"
          },
          {
            "start": "2099.119",
            "dur": "5.441",
            "text": "\"Are you going to die?\" You know, and I'll say, \"Well, someday.\" Yeah. I I'm"
          },
          {
            "start": "2104.56",
            "dur": "7.16",
            "text": "You know, well, one thing you can say about cancer, it grows on you, you know. So anyway,"
          },
          {
            "start": "2112.079",
            "dur": "6.241",
            "text": "you don't know how long I've been waiting to tell that joke. All righty."
          },
          {
            "start": "2118.32",
            "dur": "6",
            "text": "Well, so here uh we have survived another Halloween holiday. Now, I know"
          },
          {
            "start": "2124.32",
            "dur": "8.48",
            "text": "we don't acknowledge such a time, but you have to admit that almost all of our society wallows in this bunch of hoie."
          },
          {
            "start": "2132.8",
            "dur": "7.92",
            "text": "You know, the dark side uh loves its one day of the year, I guess. And and and that's okay. After all, don't we have a"
          },
          {
            "start": "2140.72",
            "dur": "5.6",
            "text": "holiday for atheists uh on April 1st?"
          },
          {
            "start": "2146.32",
            "dur": "6.32",
            "text": "That's a growner. You You got to think about that one. Okay, let's turn our let's turn"
          },
          {
            "start": "2152.64",
            "dur": "7.84",
            "text": "Halloween on his pointy little head and actually learn some lessons to help us in our Christian walk. Let's discuss"
          },
          {
            "start": "2160.48",
            "dur": "5.599",
            "text": "the Walking Dead. Stories about zombies, it is said, fill"
          },
          {
            "start": "2166.079",
            "dur": "6.161",
            "text": "us all with terrible dread. Lazarus kicked off. And don't you dare"
          },
          {
            "start": "2172.24",
            "dur": "5.52",
            "text": "scoff as I tell you about the real Walking Dead."
          },
          {
            "start": "2177.76",
            "dur": "6.48",
            "text": "All right, we all remember the Walking Dead TV franchise. Uh, it's all pretty silly. Really, I did kind of enjoy it."
          },
          {
            "start": "2184.24",
            "dur": "5.2",
            "text": "All right, I enjoy silliness. Okay. But you know, much literature when you get"
          },
          {
            "start": "2189.44",
            "dur": "5.84",
            "text": "down to it, even horror literature, uh, books, movies, TVs, uh, TV shows, that"
          },
          {
            "start": "2195.28",
            "dur": "8.319",
            "text": "kind of thing are really what they're doing is they are exploring the innermost fears and hang-ups that we"
          },
          {
            "start": "2203.599",
            "dur": "7.361",
            "text": "people have. For instance, Frankenstein uh or Frankenstein,"
          },
          {
            "start": "2210.96",
            "dur": "6.08",
            "text": "if you all know that movie, uh is really an explanation of man's desire to be"
          },
          {
            "start": "2217.04",
            "dur": "6.48",
            "text": "God, to finally take control of life and death."
          },
          {
            "start": "2223.52",
            "dur": "5.52",
            "text": "Remember, that's what got Adam and Eve a lot of trouble when when Satan tempted"
          },
          {
            "start": "2229.04",
            "dur": "5.92",
            "text": "Eve by saying, among other things, you can be like God."
          },
          {
            "start": "2234.96",
            "dur": "8.399",
            "text": "Hm. Didn't work out so well, did it? Dracula, I think, is a metaphor for"
          },
          {
            "start": "2243.359",
            "dur": "5.841",
            "text": "letting evil into your life. Remember, Dracula can't come into your"
          },
          {
            "start": "2249.2",
            "dur": "6.879",
            "text": "room unless you invite him. So, a lot of his effort is convincing you uh to let"
          },
          {
            "start": "2256.079",
            "dur": "6.401",
            "text": "him in. Kind of like the devil does. The devil throws his temptations in our"
          },
          {
            "start": "2262.48",
            "dur": "5.599",
            "text": "face and finally we break down and invite the devil into our lives like"
          },
          {
            "start": "2268.079",
            "dur": "7.04",
            "text": "Dracula coming through the door or the window and the result is deadly."
          },
          {
            "start": "2275.119",
            "dur": "6.72",
            "text": "And of course there's the aforementioned Walking Dead. It it's all about the very popular theme of what to do in the"
          },
          {
            "start": "2281.839",
            "dur": "6.321",
            "text": "zombie apocalypse. Most people succumb to the zombie virus, but a small band of"
          },
          {
            "start": "2288.16",
            "dur": "6.4",
            "text": "still normal people fight for survival. Kind of reminds us reminds us of us,"
          },
          {
            "start": "2294.56",
            "dur": "6.72",
            "text": "aren't we? Kind of a small band of people making our way through the apocalypse of mostly lost people in this"
          },
          {
            "start": "2301.28",
            "dur": "7.6",
            "text": "world. And you know, there are forces out there in society that would try their best to turn us into one of them,"
          },
          {
            "start": "2308.88",
            "dur": "8.959",
            "text": "non-believers. And while nobody wants to descend upon us and eat us yet, still is the effect"
          },
          {
            "start": "2317.839",
            "dur": "6.081",
            "text": "that the effect is the same which is death and death eternal."
          },
          {
            "start": "2323.92",
            "dur": "6.24",
            "text": "They would try to rob us of our salvation uh if if they could."
          },
          {
            "start": "2330.16",
            "dur": "5.76",
            "text": "And when you really get down to it, at the end of the day, persecution is persecution."
          },
          {
            "start": "2335.92",
            "dur": "6.159",
            "text": "uh whether it's like violence like they have overseas. We see all the people"
          },
          {
            "start": "2342.079",
            "dur": "6.881",
            "text": "over in Africa being slaughtered just because they're Christians. In fact, it's so bad that the State Department's"
          },
          {
            "start": "2348.96",
            "dur": "6.24",
            "text": "kind of getting involved, telling them, \"You better do something about this or we'll do it for you.\" You know, wow,"
          },
          {
            "start": "2355.2",
            "dur": "6",
            "text": "that's a breath of fresh air. It's still whether it's that or just"
          },
          {
            "start": "2361.2",
            "dur": "5.68",
            "text": "persecution like we have here at home which is more cerebral uh it's all aimed"
          },
          {
            "start": "2366.88",
            "dur": "5.92",
            "text": "at destroying our faith and our eternal destiny."
          },
          {
            "start": "2372.8",
            "dur": "6.319",
            "text": "Every zombie show has its own rules about how zombies act and stuff, but you"
          },
          {
            "start": "2379.119",
            "dur": "6.161",
            "text": "know, as much as I love a good zombie movie, uh you'll be surprised to learn"
          },
          {
            "start": "2385.28",
            "dur": "7.6",
            "text": "I'm not here to talk about zombies. No, we're here to teach about life"
          },
          {
            "start": "2392.88",
            "dur": "6.239",
            "text": "and life eternal. So, I propose we do that by looking at life from the vantage"
          },
          {
            "start": "2399.119",
            "dur": "5.361",
            "text": "point of a dude who found himself in the fantastic position of having died, but"
          },
          {
            "start": "2404.48",
            "dur": "5.52",
            "text": "he was raised by our Lord to walk again to fulfill his divine purpose. And of"
          },
          {
            "start": "2410",
            "dur": "7.119",
            "text": "course, uh, as as we can tell, I want to talk about Lazarus. Now, we find this in the 11th chapter of"
          },
          {
            "start": "2417.119",
            "dur": "5.201",
            "text": "John. Got a bit of scripture to read, so we better get to it. Starting in verse"
          },
          {
            "start": "2422.32",
            "dur": "5.6",
            "text": "one. Now, a man named Lazarus wasn't sick. He was from Bethany, the village"
          },
          {
            "start": "2427.92",
            "dur": "5.679",
            "text": "of Mary and her sister Martha. This Mary, whose brother Lazarus now lay sick, was the same one who poured"
          },
          {
            "start": "2433.599",
            "dur": "6.48",
            "text": "perfume on the Lord and wiped his feet with her hair. So the sisters sent word to Jesus, \"Lord, the one you love is"
          },
          {
            "start": "2440.079",
            "dur": "6.241",
            "text": "sick.\" When he heard this, Jesus said, \"This sickness will not end in death. No, it"
          },
          {
            "start": "2446.32",
            "dur": "6.08",
            "text": "is for God's glory so that God's son may be glorified through it.\" Now Jesus"
          },
          {
            "start": "2452.4",
            "dur": "8.08",
            "text": "loved Martha and her sister and Lazarus. So when he heard that Lazarus was sick, he stayed where he was two more days."
          },
          {
            "start": "2460.48",
            "dur": "7.04",
            "text": "Then he said to his disciples, \"Let us go back to Judea.\" But rabbi, they said, \"A short while"
          },
          {
            "start": "2467.52",
            "dur": "5.28",
            "text": "ago, the Jews there tried to stone you, and yet you want to go back.\" Jesus"
          },
          {
            "start": "2472.8",
            "dur": "7.6",
            "text": "answered, \"Are there not 12 hours of daylight? Anyone who walks in the daytime will not stumble, for they see"
          },
          {
            "start": "2480.4",
            "dur": "5.76",
            "text": "uh by this world's light.\" It is when a person walks at night that they stumble,"
          },
          {
            "start": "2486.16",
            "dur": "6.8",
            "text": "for they have no light.\" After he had said this, he went on to tell them, \"Our friend Lazarus has fallen asleep, but"
          },
          {
            "start": "2492.96",
            "dur": "6.56",
            "text": "I'm going there to wake him up.\" His disciples reply replied, \"Lord, if he sleeps, he'll get better.\""
          },
          {
            "start": "2499.52",
            "dur": "6.079",
            "text": "Jesus had been speaking of his death, but his disciples thought he meant natural sleep. So then he told them"
          },
          {
            "start": "2505.599",
            "dur": "5.201",
            "text": "plainly, \"Lazarus is dead, and for your sake I I'm glad I was not there so that"
          },
          {
            "start": "2510.8",
            "dur": "6.559",
            "text": "you may believe, but let us go to him.\" Then Thomas, also known as Ditimus. Have"
          },
          {
            "start": "2517.359",
            "dur": "7.121",
            "text": "we preached about him lately? I think we have. Yeah. Uh said to the rest of the disciples, \"Let us also go that we may"
          },
          {
            "start": "2524.48",
            "dur": "7.119",
            "text": "die with him.\" All right, let's set up the scene. Jesus and his"
          },
          {
            "start": "2531.599",
            "dur": "6.161",
            "text": "disciples escaped the Jewish leaders who were trying to kill him. And they went up and crossed the Jordan back to the"
          },
          {
            "start": "2537.76",
            "dur": "6.559",
            "text": "place where John the Baptizer had been immersing folks back in the day. So, they're hanging out there and and and"
          },
          {
            "start": "2544.319",
            "dur": "6.241",
            "text": "here comes the message. Lazarus, who you love is sick. Real sick."
          },
          {
            "start": "2550.56",
            "dur": "7.44",
            "text": "Jesus response is, \"Don't worry about it. This isn't going to end up uh in death.\" So, they so they hang there for"
          },
          {
            "start": "2558",
            "dur": "7.599",
            "text": "two more days. Then Jesus gets up and says, \"We have to go to Bethany.\" Whoa. The disciples said, \"There are a lot of"
          },
          {
            "start": "2565.599",
            "dur": "6.401",
            "text": "powerful people trying to do you in.\" to which Jesus says, \"I got this. Walk in"
          },
          {
            "start": "2572",
            "dur": "5.28",
            "text": "the light. You see what's around you. Those in the darkness stumble.\" So now"
          },
          {
            "start": "2577.28",
            "dur": "7.2",
            "text": "comes the announcement that Lazarus has died. The disciples don't get it since Jesus used the metaphor of sleep. They"
          },
          {
            "start": "2584.48",
            "dur": "5.839",
            "text": "say logically, \"So, hey, sleep's good for you if you're sick.\" So Jesus has to"
          },
          {
            "start": "2590.319",
            "dur": "6.561",
            "text": "just come out and say, \"Lazarus is dead.\" And it's a good thing I wasn't there."
          },
          {
            "start": "2596.88",
            "dur": "7.52",
            "text": "which when you get down to it means Jesus, if Jesus had been there, he would not have let Lazarus die. But the truth"
          },
          {
            "start": "2604.4",
            "dur": "7.439",
            "text": "of the matter is Lazarus had to die so that this example of God's awesome power"
          },
          {
            "start": "2611.839",
            "dur": "6.641",
            "text": "and the power manifested in his son Jesus. Uh the Jesus, you know, we're"
          },
          {
            "start": "2618.48",
            "dur": "6.56",
            "text": "talking about it 2,000 years later and we will until the end of days. to"
          },
          {
            "start": "2625.04",
            "dur": "9.68",
            "text": "which Thomas the twin plays Debbie Downer and says, \"Ah, let's all go and die with him.\" Well, that's a drag."
          },
          {
            "start": "2634.72",
            "dur": "5.359",
            "text": "Okay. Jesus and his entourage arrive. Verse 17."
          },
          {
            "start": "2640.079",
            "dur": "5.28",
            "text": "On his arrival, Jesus found Lazarus had already been in the tomb for 4 days."
          },
          {
            "start": "2645.359",
            "dur": "7.201",
            "text": "Now, Bethany was less than two miles from Jerusalem, and many Jews had come to Martha and Mary to comfort them at"
          },
          {
            "start": "2652.56",
            "dur": "5.68",
            "text": "the loss of their brother. When Martha heard that Jesus was coming, she went out to meet him. But Mary stayed at"
          },
          {
            "start": "2658.24",
            "dur": "5.2",
            "text": "home. Lord, Martha said to Jesus, \"If you had been here, my brother would not"
          },
          {
            "start": "2663.44",
            "dur": "5.28",
            "text": "have died.\" But I know that even now God will give you whatever you ask. Jesus"
          },
          {
            "start": "2668.72",
            "dur": "6.879",
            "text": "said to her, \"Your brother will rise again.\" Martha answered, \"I know that he will rise again in the resurrection at"
          },
          {
            "start": "2675.599",
            "dur": "6.961",
            "text": "the last day.\" Jesus said to her, \"I am the resurrection and the life. The one"
          },
          {
            "start": "2682.56",
            "dur": "6.72",
            "text": "who believes in me will live even though they die. And whoever lives by believing in me will never die. Do you believe"
          },
          {
            "start": "2689.28",
            "dur": "7.52",
            "text": "this? Yes, Lord, she replied. I believe that you are the Messiah, the son of God who is to come into the world. Now, this"
          },
          {
            "start": "2696.8",
            "dur": "5.92",
            "text": "is one of those great I am statements. A couple of thoughts here."
          },
          {
            "start": "2702.72",
            "dur": "8.879",
            "text": "I'm wondering about Martha's countenance to Jesus. Was she angry, accusing, shouting even?"
          },
          {
            "start": "2711.599",
            "dur": "6.161",
            "text": "or was she sad and forlorn seeking comfort? Also, it would appear that Martha did"
          },
          {
            "start": "2717.76",
            "dur": "7.12",
            "text": "have some understanding where life was going in all this. She knew of the resurrection of the last day. Martha"
          },
          {
            "start": "2724.88",
            "dur": "6.4",
            "text": "goes to Mary who comes out of the house and to where Jesus was with all the mourers trailing behind her and she"
          },
          {
            "start": "2731.28",
            "dur": "5.44",
            "text": "falls at Jesus' feet again wondering where in in the heaven was he had he"
          },
          {
            "start": "2736.72",
            "dur": "7.2",
            "text": "just been here. It's such a powerful moment."
          },
          {
            "start": "2743.92",
            "dur": "6.64",
            "text": "Mary face down bow bowing out before him pours out her grief and and it's so"
          },
          {
            "start": "2750.56",
            "dur": "5.84",
            "text": "powerful that Jesus joins her in this outpouring. Now remember these are close"
          },
          {
            "start": "2756.4",
            "dur": "5.76",
            "text": "friends of Jesus. They're not business associates. They're not acquaintances."
          },
          {
            "start": "2762.16",
            "dur": "6.64",
            "text": "They have spent significant time together and they've made a bond of friendship and love that is deep. So he"
          },
          {
            "start": "2768.8",
            "dur": "6.08",
            "text": "asked, \"Where's the tomb?\" And the entire entourage goes there."
          },
          {
            "start": "2774.88",
            "dur": "7.12",
            "text": "Of course, there were gripers and grumblers grumbling around about Jesus not being"
          },
          {
            "start": "2782",
            "dur": "5.119",
            "text": "there to save Lazarus. After all, he cured a blind man, didn't he? Surely, he"
          },
          {
            "start": "2787.119",
            "dur": "5.601",
            "text": "could have healed his friend. Did you know that there is a traditional"
          },
          {
            "start": "2792.72",
            "dur": "7.359",
            "text": "place that has been identified since the 4th century as Lazarus's tomb? Is it the"
          },
          {
            "start": "2800.079",
            "dur": "6.961",
            "text": "real McCoy? Well, you can make a case either way. We do know that's in the it's in the vicinity if nothing else."
          },
          {
            "start": "2807.04",
            "dur": "7.36",
            "text": "Looks like some American tourists there having a good time. Also looks like they really could spend some money on some"
          },
          {
            "start": "2814.4",
            "dur": "8.84",
            "text": "new signs and landscaping. Yeah. All right, let's go back to the text."
          },
          {
            "start": "2823.599",
            "dur": "7.921",
            "text": "Verse 38. Jesus, once more deeply moved, came to the tomb. It was a cave with a stone"
          },
          {
            "start": "2831.52",
            "dur": "6.88",
            "text": "laid across the entrance. Take away the stone, he said. But Lord, said Martha, the sister of the dead man. By this time"
          },
          {
            "start": "2838.4",
            "dur": "6.719",
            "text": "there is a bad odor, for he's been there four days. Then Jesus said, did I not tell you if you believe you will see the"
          },
          {
            "start": "2845.119",
            "dur": "6.081",
            "text": "glory of God? So they took away the stone. Then Jesus looked up and said, \"Father,"
          },
          {
            "start": "2851.2",
            "dur": "6",
            "text": "I thank you that you've heard me. I knew that you always hear me, but I said this for the benefit of the people standing"
          },
          {
            "start": "2857.2",
            "dur": "5.919",
            "text": "here that they may believe that you sent me.\" When he had said this, Jesus called"
          },
          {
            "start": "2863.119",
            "dur": "7.601",
            "text": "out in a loud voice, \"Lazarus, come out.\" The dead man came out, his hands"
          },
          {
            "start": "2870.72",
            "dur": "6.16",
            "text": "and feet wrapped with strips of linen and a cloth around his face. He said to them, \"Take off the grave clothes and"
          },
          {
            "start": "2876.88",
            "dur": "7.36",
            "text": "let him go.\" All right. Sometimes, you know, while I like to preach and study NIV, I I still"
          },
          {
            "start": "2884.24",
            "dur": "6.4",
            "text": "appreciate the language of the bard of Shakespeare of King James and and when"
          },
          {
            "start": "2890.64",
            "dur": "5.959",
            "text": "Marth when she said, \"Uh, he surely stinkketh.\""
          },
          {
            "start": "2897.119",
            "dur": "5.44",
            "text": "That's a lot more graphic. There's a bad odor. You know, NIV is way too sterile"
          },
          {
            "start": "2902.559",
            "dur": "7.601",
            "text": "for my Anyway, uh anyway, okay, here we go. All righty."
          },
          {
            "start": "2910.16",
            "dur": "7.76",
            "text": "When you get down to it, the account of the miracle itself is short, sweet, and to the point."
          },
          {
            "start": "2917.92",
            "dur": "5.679",
            "text": "You have the telling of Jesus's distress. What was he so upset about? Wording would indicate not just grief,"
          },
          {
            "start": "2923.599",
            "dur": "5.121",
            "text": "but significant anger. Now, theologians have put up several"
          },
          {
            "start": "2928.72",
            "dur": "5.76",
            "text": "ideas, including maybe he was just upset that all those mourers were just fake."
          },
          {
            "start": "2934.48",
            "dur": "5.359",
            "text": "You know, they that's just what they do. They travel around and and uh whail and"
          },
          {
            "start": "2939.839",
            "dur": "7.601",
            "text": "moan and and uh Jesus hates falseeness. And uh you know, uh maybe maybe he was"
          },
          {
            "start": "2947.44",
            "dur": "5.04",
            "text": "steamed that some people are going to see a tremendous miracle"
          },
          {
            "start": "2952.48",
            "dur": "6.48",
            "text": "and yet write him out to the authorities anyway. Yeah, who knows?"
          },
          {
            "start": "2958.96",
            "dur": "7.2",
            "text": "Maybe there were forces at work in the spiritual realm that we would know nothing about, but that Jesus would be"
          },
          {
            "start": "2966.16",
            "dur": "6.56",
            "text": "aware of. Maybe Satan thought he had just pulled one over on Jesus."
          },
          {
            "start": "2972.72",
            "dur": "7.359",
            "text": "Now, we won't know the answer to any of these questions until we're there with Jesus in glory. But the simplicity of"
          },
          {
            "start": "2980.079",
            "dur": "6.24",
            "text": "the narrative has the ring of truth in it. This is an eyewitness account of an"
          },
          {
            "start": "2986.319",
            "dur": "5.361",
            "text": "extraordinary event in the ministry of Jesus. No fancy exclamations or"
          },
          {
            "start": "2991.68",
            "dur": "8.48",
            "text": "explanations or explanations, no outbursts of extraneous detail, just a report of the facts as they happened."
          },
          {
            "start": "3000.16",
            "dur": "5.28",
            "text": "Lazarus was dead. Yet he walked the"
          },
          {
            "start": "3005.44",
            "dur": "5.04",
            "text": "walking dead, so to speak. Which brings us to our sermon in a sentence, which is"
          },
          {
            "start": "3010.48",
            "dur": "9.04",
            "text": "we are the walking dead, but we have life in Jesus the Messiah."
          },
          {
            "start": "3019.52",
            "dur": "7.36",
            "text": "So tell me, how many times have you died? I mean, I I don't mean how how many times you coded in the hospital and"
          },
          {
            "start": "3026.88",
            "dur": "7.439",
            "text": "they brought you back. I mean, how many times have we died spiritually?"
          },
          {
            "start": "3034.319",
            "dur": "7.201",
            "text": "When we ponder this question, we realize that we really are the walking dead. And thanks be to God, we have life in Jesus."
          },
          {
            "start": "3041.52",
            "dur": "8.64",
            "text": "So, let's flesh this out. Number one, walking dead in sins."
          },
          {
            "start": "3050.16",
            "dur": "8",
            "text": "Paul said in Ephesians 2:1, \"As for you, you were dead in your transgressions transgressions and sin.\" You know, Paul"
          },
          {
            "start": "3058.16",
            "dur": "5.919",
            "text": "here admits that we all lived among them at one time. lived among the walking"
          },
          {
            "start": "3064.079",
            "dur": "7.201",
            "text": "dead, steeped in our disobedience, following the kingdom of the air, gratifying the cravings of the flesh,"
          },
          {
            "start": "3071.28",
            "dur": "6.799",
            "text": "following the desires and thoughts of that. Because of all that, we were walking around spiritually dead,"
          },
          {
            "start": "3078.079",
            "dur": "5.681",
            "text": "destined for death and damnation. It's a terrible place to be living among them,"
          },
          {
            "start": "3083.76",
            "dur": "8.48",
            "text": "as Paul says. So, so, huh, that's a bummer. The next death is good. walking dead to"
          },
          {
            "start": "3092.24",
            "dur": "7.52",
            "text": "sin. We see the difference. We the walking dead go from walking uh dead in sin to"
          },
          {
            "start": "3099.76",
            "dur": "5.839",
            "text": "being the walking dead to sin. Death is separation."
          },
          {
            "start": "3105.599",
            "dur": "5.841",
            "text": "When when we're dead in sin, we're separated from God. When we're dead to"
          },
          {
            "start": "3111.44",
            "dur": "5.36",
            "text": "sin, we're separated from evil. Romans 6:11. In the same way, count"
          },
          {
            "start": "3116.8",
            "dur": "7.039",
            "text": "yourselves dead to sin, but alive to God in Christ Jesus. The most horrifying"
          },
          {
            "start": "3123.839",
            "dur": "6.081",
            "text": "effect of sin is that it separates us from God. Think about it. When when the"
          },
          {
            "start": "3129.92",
            "dur": "6.08",
            "text": "dead in sin die a physical death, the result is separation from God and"
          },
          {
            "start": "3136",
            "dur": "7.119",
            "text": "eternity in hell. We don't preach much about hell, do we? We're not supposed to tell people that"
          },
          {
            "start": "3143.119",
            "dur": "5.601",
            "text": "sinners go to hell. It's not at all loving to talk about hell. In fact, it's"
          },
          {
            "start": "3148.72",
            "dur": "6",
            "text": "frightening and some people find it offensive. But uh"
          },
          {
            "start": "3154.72",
            "dur": "5.8",
            "text": "who are we to not warn people about this?"
          },
          {
            "start": "3160.64",
            "dur": "5.04",
            "text": "Jesus described it as a place of wailing and nashing of teeth."
          },
          {
            "start": "3165.68",
            "dur": "7.04",
            "text": "Sometimes it's given the name of of the Jerusalem city trash. Did you know that? Gehenna. which means uh if you're in"
          },
          {
            "start": "3172.72",
            "dur": "7.44",
            "text": "hell, you're not uh in the you're in the not so sanitary landfill of the cosmos."
          },
          {
            "start": "3180.16",
            "dur": "6.88",
            "text": "There you are. No hope, no comfort, no torment and regret, and it never ends. We're going to talk a lot more about"
          },
          {
            "start": "3187.04",
            "dur": "6.319",
            "text": "this. I think that'll be next week. This is it's what we call a tease. You"
          },
          {
            "start": "3193.359",
            "dur": "6.321",
            "text": "know, Revelation 14:11. And the smoke of their torment will rise forever and ever."
          },
          {
            "start": "3199.68",
            "dur": "6.639",
            "text": "There will be no rest. day or night for those who worship the beast and its image or for anyone who receives the"
          },
          {
            "start": "3206.319",
            "dur": "6.721",
            "text": "mark of its name. All right. Number three, walking dead in Jesus. And this"
          },
          {
            "start": "3213.04",
            "dur": "5.519",
            "text": "is what it's all about. I know that present day society just wants to hear about rainbows and"
          },
          {
            "start": "3218.559",
            "dur": "7.361",
            "text": "unicorns. Nobody wants to be told they're not perfect. They're not just fine. They're not cool and groovy. Sorry"
          },
          {
            "start": "3225.92",
            "dur": "6",
            "text": "for the anacronism there. Uh, nobody wants to hear anything except heaven"
          },
          {
            "start": "3231.92",
            "dur": "5.12",
            "text": "waiting and what they call the afterlife."
          },
          {
            "start": "3237.04",
            "dur": "7.92",
            "text": "The walking dead in their sins threw up a huge smoke screen that dictates what God can and cannot say to them. But we"
          },
          {
            "start": "3244.96",
            "dur": "6.08",
            "text": "who are of the household of faith know in whom we have uh we we have in whom we"
          },
          {
            "start": "3251.04",
            "dur": "6.16",
            "text": "have hope in whom we have faith in whom we are immersed in love. We are cleansed"
          },
          {
            "start": "3257.2",
            "dur": "6",
            "text": "by his blood raised up in newness of life. And we shall overcome not by"
          },
          {
            "start": "3263.2",
            "dur": "5.68",
            "text": "anything we've done but by the grace of the Lord most high."
          },
          {
            "start": "3268.88",
            "dur": "7.76",
            "text": "Romans 6 3 and 4. Don't you know that all of us who were baptized, immersed into Christ Jesus were baptized into his"
          },
          {
            "start": "3276.64",
            "dur": "5.6",
            "text": "death? We were therefore buried with him through baptism into death in order that"
          },
          {
            "start": "3282.24",
            "dur": "7.76",
            "text": "just as Christ was raised from the dead through the glory of the father, we too may live a new life."
          },
          {
            "start": "3290",
            "dur": "6.48",
            "text": "And that's the whole kitten kaboodleoodle right there. So when we talk about the walking dead, we're not"
          },
          {
            "start": "3296.48",
            "dur": "8.24",
            "text": "talking about death as the world knows it. We're talking about life, life, living it to the full. But a great"
          },
          {
            "start": "3304.72",
            "dur": "5.92",
            "text": "and terrible day of the Lord is coming. First Thessalonians 4:16, for the Lord"
          },
          {
            "start": "3310.64",
            "dur": "5.919",
            "text": "himself will come down from heaven with a loud command, with the voice of the"
          },
          {
            "start": "3316.559",
            "dur": "6.161",
            "text": "archangel, with the trumpet call of God, and the dead in Christ will rise first."
          },
          {
            "start": "3322.72",
            "dur": "7.359",
            "text": "So for now, we're here. And here's what I want us to do."
          },
          {
            "start": "3330.079",
            "dur": "6.881",
            "text": "We the walking dead go about our way here in our assignment. Each of this"
          },
          {
            "start": "3336.96",
            "dur": "7.2",
            "text": "each of us this week identify how we the walking dead display the power of God."
          },
          {
            "start": "3344.16",
            "dur": "7.36",
            "text": "Lazarus displayed the power of God. He didn't have any choice. We see in scripture others who showed uh God is"
          },
          {
            "start": "3351.52",
            "dur": "7.76",
            "text": "the master of death. We see h how uh the show of power in God of God in in that"
          },
          {
            "start": "3359.28",
            "dur": "6",
            "text": "and also in our resurrection. How do we know we show the power of God?"
          },
          {
            "start": "3365.28",
            "dur": "7.279",
            "text": "You know that as well as I. We we live the life. We walk the walk. We talk the talk. We let everyone see the change"
          },
          {
            "start": "3372.559",
            "dur": "5.04",
            "text": "that the power of God brings about in our lives. In essence, we all show the"
          },
          {
            "start": "3377.599",
            "dur": "6.401",
            "text": "fruit of the spirit. Galatians 5:22 and 23. But the fruit of the spirit is love,"
          },
          {
            "start": "3384",
            "dur": "6.64",
            "text": "joy, peace, forbearance, kindness, goodness, faithfulness, gentleness, and self-control. Against such things there"
          },
          {
            "start": "3390.64",
            "dur": "6",
            "text": "is no law. What a wonderful world if everyone acted like this. What a"
          },
          {
            "start": "3396.64",
            "dur": "7.52",
            "text": "wonderful world we are when we make this our lifestyle. And what a wonderful eternity as we live"
          },
          {
            "start": "3404.16",
            "dur": "5.439",
            "text": "face to face with God and are just like this. Amen."
          },
          {
            "start": "3409.599",
            "dur": "5.52",
            "text": "Alrighty. I tell you what. Oh, let's let's get let's wrap this up"
          },
          {
            "start": "3415.119",
            "dur": "5.121",
            "text": "here because I'm hungry. I'm hungry and ready ready to to have"
          },
          {
            "start": "3420.24",
            "dur": "6.96",
            "text": "some grub. And you know these these uh Oh, there we go. Uh you know these these"
          },
          {
            "start": "3427.2",
            "dur": "5.359",
            "text": "potlucks, they're so good."
          },
          {
            "start": "3432.559",
            "dur": "6.681",
            "text": "Lots of carbs. So I have to repent and be good after."
          },
          {
            "start": "3439.76",
            "dur": "5.039",
            "text": "But anyway, so just a just an add thought as we get ready to be dismissed."
          },
          {
            "start": "3444.799",
            "dur": "5.04",
            "text": "Uh, you know, I don't know what the Lord has in store for me here, uh, besides"
          },
          {
            "start": "3449.839",
            "dur": "8.161",
            "text": "chemo and all that good stuff. So, I don't know how long my tenure will be here. But if you've never been immersed,"
          },
          {
            "start": "3458",
            "dur": "8",
            "text": "if you've never been baptized, you know, we've baptized about 10 people so far here, myself and Nathaniel."
          },
          {
            "start": "3466",
            "dur": "7.2",
            "text": "If you've never done that and you want me to do it, might be it might be time"
          },
          {
            "start": "3473.2",
            "dur": "8.639",
            "text": "to get around. All right. Yeah, it might be time to start. Okay. Well, we better hurry up here. Uh"
          },
          {
            "start": "3481.839",
            "dur": "5.441",
            "text": "because that is uh you know, it's a big it's a big deal to me. And and I know"
          },
          {
            "start": "3487.28",
            "dur": "5.839",
            "text": "that so many people don't think it's any big deal. All I know is is what I read."
          },
          {
            "start": "3493.119",
            "dur": "6",
            "text": "And what I read is, I'm going to obey. You know, the Lord said to do this. The"
          },
          {
            "start": "3499.119",
            "dur": "6.24",
            "text": "Lord said you have to be born of water and spirit uh to be in his kingdom. You"
          },
          {
            "start": "3505.359",
            "dur": "5.361",
            "text": "know, and and and it's all part of of your your heart and your mindset. Uh"
          },
          {
            "start": "3510.72",
            "dur": "7.8",
            "text": "there's a a Keith Green song, you can be baptized so many times the fishes know you by name."
          },
          {
            "start": "3518.799",
            "dur": "5.04",
            "text": "And you know, but it is your heart. So, you know, do do come talk to us. I think"
          },
          {
            "start": "3523.839",
            "dur": "6",
            "text": "there'll probably be a baptism class coming up before too long and and everything. So, yeah. Uh and and of"
          },
          {
            "start": "3529.839",
            "dur": "6.161",
            "text": "course, the main the main qualification, you know, to be baptized here is to walk"
          },
          {
            "start": "3536",
            "dur": "7.44",
            "text": "up to me and say, I believe that Jesus is the Christ, the son of the living God, you know, and we'll we'll get her"
          },
          {
            "start": "3543.44",
            "dur": "6.32",
            "text": "done our gar. All right. All right. I'm hungry. Let's be standing."
          },
          {
            "start": "3549.76",
            "dur": "6.799",
            "text": "Our God and our father, I thank you for the privilege of being the messenger of your"
          },
          {
            "start": "3556.559",
            "dur": "5.921",
            "text": "word. I thank you for this congregation, this good congregation, this loving"
          },
          {
            "start": "3562.48",
            "dur": "5.68",
            "text": "congregation and and I thank you that uh we are"
          },
          {
            "start": "3568.16",
            "dur": "6.159",
            "text": "indeed the household of faith. So now, holy father, we are going to"
          },
          {
            "start": "3574.319",
            "dur": "5.201",
            "text": "gather for our uh fellowship. We pray that you'll bless the food to our"
          },
          {
            "start": "3579.52",
            "dur": "8.16",
            "text": "nourishment. Bless the hands that have prepared it and also bless us as the transition team makes their big reveal"
          },
          {
            "start": "3587.68",
            "dur": "5.36",
            "text": "and what all they've been up to and the and all this good stuff. So, Holy"
          },
          {
            "start": "3593.04",
            "dur": "7.279",
            "text": "Father, bless us now. We pray in the precious name of Jesus. Amen."
          },
          {
            "start": "3600.319",
            "dur": "5.76",
            "text": "Amen. Your good, good father. It's who you"
          },
          {
            "start": "3606.079",
            "dur": "5.681",
            "text": "are. It's who you are. It's who you are."
          },
          {
            "start": "3611.76",
            "dur": "9.76",
            "text": "And I'm loved by you. It's who I am. It's who I am. It's who I am. You're a"
          },
          {
            "start": "3621.52",
            "dur": "8.96",
            "text": "good, good father. It's who you are. It's who you are. It's who you are. And"
          },
          {
            "start": "3630.48",
            "dur": "9.97",
            "text": "I'm loved by you. It's who I am. It's who I am. It's who I am."
          },
          {
            "start": "3640.45",
            "dur": "5.47",
            "text": "[Music] See you across the street. Have a good"
          },
          {
            "start": "3645.92",
            "dur": "3",
            "text": "week."
          }
        ]
      }
    ]
  }
]
